{
    "labs": [
      {
        "name": "Mechatronics Laboratory",
  "equipments": [
    {
      "name": "Compact RIO Standard 8-Slot Chassis System",
      "image": "/New BTP/Mechatronics Laboratory/Compact RIO Standard 8-Slot Chassis System.jpg",
      "description": [
        "The Compact RIO standard 8-slot chassis system is a versatile and powerful device primarily used in mechatronics and automation systems. It serves as a platform to interface multiple drives and measure electrical parameters like current and voltage through Ethernet connectivity. The system is equipped with C Series modules that provide flexibility for various applications, including real-time data acquisition, control, and signal processing.",
        "This equipment is utilized in research, development, and industrial setups to monitor and analyze electrical systems effectively. The Ethernet-based expansion chassis allows seamless integration with other devices and systems, enabling remote data transmission and control. Users can configure the system for specific applications by installing compatible modules into the slots. It is highly reliable for tasks requiring high-speed data processing and robust performance in monitoring and controlling complex electromechanical systems."
      ]},
    {
      "name": "Autonomous Robotics System Design Platform",
      "image": "/New BTP/Mechatronics Laboratory/Autonomous Robotics System Design Platform.jpg",
      "description": [
        "The Autonomous Robotics System Design Platform is a cutting-edge embedded deployment platform that integrates a real-time processor, reconfigurable field-programmable gate array (FPGA), and analog and digital input/output (I/O) capabilities on a single board. Its primary purpose is to support the development and deployment of autonomous robotic systems, enabling precise control, real-time processing, and advanced computational tasks.",
        "This platform is used to design, test, and implement robotics systems for applications such as navigation, object detection, and motion control. The real-time processor ensures high-speed computation, while the FPGA allows for reconfigurable hardware to accommodate specific tasks and optimize performance. Analog and digital I/O facilitate seamless integration with sensors, actuators, and other peripherals. This system is ideal for robotics research, prototyping, and industrial automation, enabling the creation of robust, efficient, and intelligent robotic solutions."
      ]
      },
    {
      "name": "Embedded Control Platform",
      "image": "/New BTP/Mechatronics Laboratory/Embedded Control Platform.jpeg",
      "description": [
        "The Embedded Control Platform is designed for creating and testing embedded system hardware projects. It includes a microcontroller at its core, supported by multiple accessories such as sensors, actuators, communication modules, and power management units. The platform serves as a comprehensive toolkit for the development, integration, and prototyping of embedded systems in diverse applications.",
        "This platform is used to design and implement real-time control systems for various hardware projects. Developers can program the controller to interact with external devices, perform data acquisition, and execute control algorithms. The platform’s modularity allows seamless integration of additional components to suit project-specific requirements. It is widely employed in automation, robotics, IoT devices, and educational projects, providing a hands-on approach to understanding embedded systems. By enabling rapid prototyping and testing, it accelerates the development of innovative and efficient hardware solutions."
      ]
      },
    {
      "name": "Mechatronics System Design Platform",
      "image": "/New BTP/Mechatronics Laboratory/Mechatronics System Design Platform.jpg",
      "description": [
        "The Mechatronics System Design Platform is used to develop and test integrated mechatronic systems by interfacing various sensors and actuators with myRIO, an embedded hardware system from National Instruments. This platform is essential for real-time control, data acquisition, and system prototyping in mechatronics and automation applications.",
        "The system connects sensors (like temperature, pressure, and motion sensors) and actuators (such as motors and pneumatic drives) to the myRIO controller. Through graphical programming interfaces like LabVIEW, users can process sensor inputs, execute control algorithms, and drive actuators to achieve desired mechanical outputs.",
        "This platform is widely employed in education, research, and industry for tasks like automation, robotics, and system design. It simplifies complex mechatronics projects, offering a modular and user-friendly approach to integrating hardware and software components for real-time applications."
      ]
      },
    {
      "name": "Cathode Ray Oscilloscope (CRO)",
      "image": "/New BTP/Mechatronics Laboratory/Cathode Ray Oscilloscope (CRO).jpg",
      "description": [
        "The Cathode Ray Oscilloscope (CRO) is a vital instrument used to analyze various waveform signals in electrical and electronic systems. It provides a visual representation of voltage variations over time, allowing users to observe signal characteristics like amplitude, frequency, phase, and shape.",
        "The CRO operates by converting electrical signals into a visual trace on its screen using an electron beam. Signals from the circuit under test are fed into the oscilloscope through probes, and the device displays them as a waveform. Controls allow users to adjust the time base, sensitivity, and other parameters for detailed analysis.",
        "CROs are widely used in laboratories, research, and diagnostics for tasks like troubleshooting circuits, testing signal integrity, and analyzing waveforms in communication systems. It is an indispensable tool for engineers, technicians, and researchers in understanding and refining electronic and electrical systems."
      ]
      },
    {
      "name": "Easyport Training Kit",
      "image": "/New BTP/Mechatronics Laboratory/Easyport Training Kit.jpg",
      "description": [
        "The Easyport Training Kit is a versatile interface device designed for educational and experimental purposes. It facilitates the measurement, open-loop control, and closed-loop control of various processes, seamlessly bridging the gap between simulation and real-world applications. The kit connects to external systems and sensors, allowing real-time data acquisition and analysis.",
        "In operation, the Easyport Training Kit gathers input signals from connected devices or sensors and sends them to a computer or controller for processing. Users can simulate control strategies, observe system responses, and implement corrective actions in real-time. Its capability to perform open-loop control enables manual testing of systems, while closed-loop control automates feedback mechanisms for improved precision.",
        "This kit is widely used in mechatronics, control engineering, and automation laboratories for hands-on learning and experimentation, making it an essential tool for understanding practical applications of control systems in real-world scenarios."
      ]
      },
    {
      "name": "Modular Production System - Distributing Station",
      "image": "/New BTP/Mechatronics Laboratory/Modular Production System - Distributing Station.jpg",
      "description": [
        "The Modular Production System-Distributing Station is a training platform designed to teach the principles of automation in manufacturing, focusing on pick-and-place operations using pneumatic cylinders (rotary and linear) and programmable logic controllers (PLCs).",
        "This system simulates a production environment where components are picked from one station and placed accurately at another. Pneumatic cylinders execute the rotary and linear movements, controlled by a PLC that governs the sequence of operations. Trainees program the PLC to manage timing, motion, and coordination between the cylinders, ensuring smooth operation.",
        "The system is used to develop skills in automation, control logic, and troubleshooting in industrial processes. It is a valuable educational tool for understanding automated manufacturing concepts, enabling students to gain hands-on experience with real-world applications of PLC programming and pneumatic systems in modern production setups."
      ]
      },
    {
      "name": "LME EV3 Core Set (LEGO)",
      "image": "/New BTP/Mechatronics Laboratory/LME EV3 Core Set (LEGO).jpg",
      "description": [
        "The LME EV3 Core Set (LEGO Mindstorms Education EV3) is an interactive educational tool designed to teach the fundamentals of building and programming robots. It is widely used to introduce students to concepts of robotics, engineering, and coding in a hands-on and engaging manner.",
        "The set includes LEGO Technic elements, intelligent EV3 bricks, motors, sensors, and various connectors to build functional robot models. Using the EV3 software or apps, students program the robots to perform tasks like movement, obstacle detection, and response to environmental stimuli.",
        "This system fosters creativity and problem-solving skills while providing practical experience with mechanical design and programming logic. It is ideal for beginners and educators to teach robotics fundamentals, preparing students for more advanced engineering and automation projects."
      ]
      },
    {
      "name": "TETRIX Education Base Set",
      "image": "/New BTP/Mechatronics Laboratory/TETRIX Education Base Set.jpg",
      "description": [
        "The TETRIX Education Base Set is a robust platform designed for building metal-structured robots, primarily used in educational and competitive robotics settings. It provides a comprehensive introduction to engineering and robotics concepts, allowing students to design, construct, and test various robotic models.",
        "The set includes heavy-duty aluminum parts, such as beams, plates, brackets, wheels, and other structural elements, along with DC motors, servos, and gears for mechanical motion. It is compatible with programmable controllers, such as Arduino or LEGO Mindstorms, enabling students to integrate programming into their creations.",
        "This versatile kit facilitates hands-on learning about mechanical assembly, structural integrity, and motion mechanics. It helps develop teamwork, problem-solving, and design-thinking skills, making it ideal for STEM education programs and robotics competitions like FIRST Tech Challenge (FTC)."
      ]
      },
    {
      "name": "LME EV3 Expansion Set",
      "image": "/New BTP/Mechatronics Laboratory/LME EV3 Expansion Set.jpg",
      "description": [
        "The LME EV3 Expansion Set is designed to enhance the learning experience of building and programming basic robots. It is an extension of the LEGO MINDSTORMS EV3 platform, offering additional components to build more complex robotic systems. The set includes motors, sensors, wheels, and structural elements that allow users to create robots with enhanced mobility, sensors for interaction with the environment, and more sophisticated movements.",
        "The expansion set is used to teach fundamental robotics and engineering concepts such as mechanical design, sensor integration, and basic programming. Using the EV3 programming environment, students can program their robots to perform specific tasks such as following a path, detecting obstacles, or interacting with their surroundings. It is ideal for introducing robotics to beginners, fostering creativity, problem-solving, and critical thinking skills. The set is widely used in classrooms and robotics competitions for hands-on learning."
      ]
      },
    {
      "name": "TETRIX Resource Set",
      "image": "/New BTP/Mechatronics Laboratory/TETRIX Resource Set.jpg",
      "description": [
        "The Tetrix Resource Set is a comprehensive collection of metal structural components, motors, sensors, and other accessories designed to help users build and customize robots. It is specifically intended for use in robotics education and competitions, offering a robust platform for building durable and functional robotic systems. The set includes aluminum beams, brackets, gears, motors, wheels, and wiring, allowing users to create a wide range of robots with varied mechanical structures and functionalities.",
        "This set is primarily used to teach students about mechanical design, engineering principles, and robotics. It enables the construction of robots for various tasks, such as remote-controlled vehicles, autonomous robots, and robotic arms. Students can integrate sensors and actuators into their designs and program the robots using compatible control systems like Tetrix or LEGO-based controllers. The Tetrix Resource Set encourages creativity, teamwork, and problem-solving, making it a versatile tool for robotics education."
      ]
      },
    {
      "name": "Multipurpose PC-Based Process Control System (SCADA Software)",
      "image": "/New BTP/Mechatronics Laboratory/Multipurpose PC-Based Process Control System (SCADA Software).jpg",
      "description": [
        "The Multipurpose PC-Based Process Control System with SCADA (Supervisory Control and Data Acquisition) software is designed to teach and demonstrate various industrial control processes. It allows students and engineers to learn how to monitor and control real-time processes in different industries, such as manufacturing, energy, and water treatment.",
        "This system integrates hardware and software to collect data from sensors, process it, and allow operators to control the process remotely. SCADA software provides a graphical user interface (GUI) that displays real-time data, alarms, and controls for various equipment, such as pumps, motors, and valves.",
        "Students use this system to understand how industrial processes are controlled and optimized. They can simulate control loops, monitor system performance, troubleshoot problems, and apply automation techniques. This setup helps to develop skills in industrial automation, control systems, and process monitoring, making it essential for learning process control."
      ]
      },
    {
      "name": "IMAX B6 5A Multipurpose Battery Charger",
      "image": "/New BTP/Mechatronics Laboratory/IMAX B6 5A Multipurpose Battery Charger.jpg",
      "description": [
        "The IMAX B6 5A multipurpose battery charger is designed for charging a variety of rechargeable batteries, particularly Lithium Polymer (LiPo) batteries, commonly used in remote control (RC) devices, drones, and other battery-powered equipment. It supports multiple battery types, including LiPo, LiFe, NiMH, and lead-acid batteries, making it versatile for different applications.",
        "The charger provides a controlled environment for battery charging, ensuring safe and efficient power transfer. It offers adjustable settings for charge rate, voltage, and capacity, allowing users to customize the charging process for optimal performance and battery lifespan. The IMAX B6 charger features a built-in safety system, such as overcharge, short circuit, and reverse polarity protection.",
        "To use, the battery is connected to the charger, settings are configured, and the charging process begins. The charger displays real-time information, including charging current, voltage, and time, providing feedback and allowing for safe, efficient battery management."
      ]
      },
    {
      "name": "Digital Storage Oscilloscope (DSO)",
      "image": "/New BTP/Mechatronics Laboratory/Digital Storage Oscilloscope (DSO).jpg",
      "description": [
        "A Digital Storage Oscilloscope (DSO) is used for analyzing and measuring electrical signals by visualizing waveforms on a screen. It captures time-varying signals, such as voltage, current, and other electronic parameters, and displays them as waveforms. The DSO can store and analyze multiple signals, providing detailed insights into their characteristics, including frequency, amplitude, phase, and waveform shape.",
        "To use the DSO, the signal is connected to the oscilloscope's input channel. The device then digitizes the analog signal and displays it on the screen, allowing the user to examine the signal's behavior over time. Users can adjust the time base, voltage scale, and trigger settings to stabilize the waveform for accurate measurements. DSOs typically include features like zoom, cursors, and advanced measurement tools to analyze the signal in detail, making them essential for troubleshooting, design verification, and signal testing in various electronic applications."
      ]
      },
    {
      "name": "DC Regulated Power Supply",
      "image": "/New BTP/Mechatronics Laboratory/DC Regulated Power Supply.jpg",
      "description": [
        "A DC Regulated Power Supply is used to provide a stable and adjustable DC voltage to electronic circuits and devices. It ensures a consistent output voltage, regardless of fluctuations in the input voltage or variations in the load. This is essential for powering sensitive electronic components and performing tests in laboratories or engineering setups.",
        "To use a DC regulated power supply, the required output voltage and current are set using the front panel controls. The device is then connected to the circuit or equipment that requires power. The power supply automatically adjusts to maintain the set voltage, providing a steady and reliable power source. It often features overcurrent and overvoltage protection to safeguard connected components from damage. DC regulated power supplies are widely used in testing, research, and development, as well as for powering prototypes, electronic equipment, and systems in industrial applications."
      ]
      },
    {
        "name": "LabVIEW Academic Site License",
        "image": "/New BTP/Mechatronics Laboratory/LabVIEW Academic Site License.jfif",
        "description": [
          "LabVIEW (Laboratory Virtual Instrument Engineering Workbench) is a graphical programming environment primarily used for developing applications that interact with measurement, control, and automation hardware. The LabVIEW Academic Site License for 5 years provides access to this software for educational purposes, allowing students, faculty, and researchers to create and design National Instrument hardware projects, experiments, and simulations.",
          "LabVIEW uses a graphical interface where users can drag and drop various function blocks to create applications, making it particularly useful for users with minimal programming experience. The software can interface with sensors, actuators, and various other devices for data acquisition, signal processing, and system control. It is commonly used in labs for prototyping, testing, and automation tasks. With the academic site license, multiple users within an educational institution can access and use LabVIEW, enabling collaborative learning and experimentation in engineering, robotics, and instrumentation fields."
        ]
        },
      {
        "name": "Ciros Studio (Software)",
        "image": "/New BTP/Mechatronics Laboratory/Ciros Studio.jfif",
        "description": [
          "Ciros Studio is a simulation and modeling software used to create virtual environments for manufacturing and production systems. The Ciros Studio Single License is typically used for simulating and analyzing manufacturing processes in a virtual setting, allowing users to model, optimize, and visualize complex production workflows.",
          "The software is particularly beneficial for designing and testing systems in manufacturing, such as Material Handling Systems, assembly lines, and logistics operations. It allows users to build virtual models of manufacturing plants and simulate the performance of different processes, helping to identify inefficiencies and areas for improvement without the need for physical prototypes. This makes it an invaluable tool in educational and research settings, particularly in mechatronics and industrial engineering courses, where students and researchers can experiment with real-world scenarios in a controlled, virtual environment. The Ciros Studio Single License provides access for one user to design, simulate, and analyze manufacturing processes for optimized system performance."
        ]
        },
      {
        "name": "LME EV3 Software Site License V24",
        "image": "/New BTP/Mechatronics Laboratory/LME EV3 Software Site License V24.png",
        "description": [
          "The LME EV3 Software Site License V24 is a graphical programming software designed for LEGO MINDSTORMS EV3 robots. This software allows users to create, test, and control robotic models built with LEGO components. It is used in educational settings, such as schools and universities, to teach robotics, programming, and engineering concepts.",
          "The software uses a drag-and-drop interface, making it accessible for beginners while also offering advanced features for more experienced users. It enables users to program robots for a wide range of tasks, such as movement, sensor interaction, and data processing. The site license allows multiple users within an institution to access and use the software on various computers, promoting collaborative learning and project development. LME EV3 Software Site License V24 is an ideal tool for hands-on learning and experimentation with robotics, providing students with a comprehensive platform for designing, coding, and testing robotic systems."
        ]
        },
      {
        "name": "Multisim Education",
        "image": "/New BTP/Mechatronics Laboratory/Multisim Education.jfif",
        "description": [
          "Multisim Education is a powerful software tool designed for the design and simulation of electronic circuits. It is widely used in educational environments to teach students about circuit theory, analysis, and electronic component functionality. The software offers a user-friendly interface for both novice and advanced users, allowing the creation, testing, and optimization of electronic circuits without the need for physical components.",
          "Students and engineers use Multisim to design schematics, simulate their behavior, and visualize how circuits operate under different conditions. It also provides a platform for creating printed circuit board (PCB) layouts, where users can transform their designs into real-world prototypes. The software includes a vast library of electronic components, along with advanced analysis tools like transient, AC, and DC analysis. Multisim Education is ideal for learning circuit design and simulation, offering hands-on experience with virtual components and testing before physical implementation."
        ]
        },
      {
        "name": "Ultiboard Education",
        "image": "/New BTP/Mechatronics Laboratory/Ultiboard Education.jfif",
        "description": [
          "Ultiboard Education is a PCB (Printed Circuit Board) design software used for creating and printing high-quality circuit board layouts. It is commonly used in educational settings to teach students the principles of PCB design and to simulate real-world applications. The software enables users to take their electronic circuit designs, developed in software like Multisim, and convert them into a physical PCB layout.",
          "Ultiboard allows students and engineers to arrange components, route electrical connections, and optimize the board’s layout for manufacturing. With its advanced design rules and auto-routing features, Ultiboard helps ensure that the final PCB design is error-free and manufacturable. The software provides a visual interface for placing components, defining layer stacks, and generating the necessary files (like Gerber files) needed for PCB fabrication. The 10-user license allows multiple students to access the software, enabling collaborative learning and practical PCB design exercises."
        ]
        },
      {
        "name": "Step 7 Programming Software",
        "image": "/New BTP/Mechatronics Laboratory/Step 7 Programming Software.jfif",
        "description": [
          "Step 7 is a PLC (Programmable Logic Controller) programming software developed by Siemens, designed for programming, configuring, and maintaining Siemens PLCs. It is widely used in industrial automation systems for controlling machines, processes, and manufacturing operations. This software supports the creation of control programs, configuration of hardware components, and integration of automation systems.",
          "Step 7 provides a comprehensive environment for writing ladder logic, structured text, and other programming languages used in PLCs. It includes tools for simulation, debugging, and troubleshooting programs before deployment to actual PLC hardware. The software also allows for the management of I/O devices, communication networks, and other industrial equipment. The twelve-license setup enables multiple users to access the software simultaneously, making it ideal for classrooms, training centers, or industrial environments where collaborative programming and real-time simulation are essential for learning and development."
        ]
        },
      {
        "name": "WinCC Single License",
        "image": "/New BTP/Mechatronics Laboratory/WinCC Single License.jfif",
        "description": [
          "WinCC (Windows Control Center) is a powerful SCADA (Supervisory Control and Data Acquisition) software developed by Siemens for monitoring, controlling, and automating industrial processes. It allows users to visualize and control complex systems in real-time, such as manufacturing lines, energy management systems, and water treatment plants.",
          "The single license version of WinCC is typically used for smaller applications or by individual users to monitor and control industrial operations. It provides a comprehensive graphical interface for displaying process data, alarms, trends, and status updates. With WinCC, users can create custom user interfaces, generate reports, and interact with PLCs (Programmable Logic Controllers) and other field devices to ensure smooth operation of the system.",
          "WinCC also includes advanced features like data logging, remote access, and security management, making it essential for efficient process control and system monitoring in various industrial environments."
        ]
        },
      {
        "name": "Mechatronics Assistant",
        "image": "/New BTP/Mechatronics Laboratory/Mechatronics Assistant.jfif",
        "description": [
          "Mechatronics Assistant is a software tool designed to simulate and assist in the development of automation systems in a virtual environment. It is used to integrate and control various mechanical, electrical, and software components within a mechatronic system. The 'Two License' version allows two users to access and work on the software simultaneously, facilitating collaboration and teaching in educational settings or small-scale automation projects.",
          "The software provides a platform to model and simulate processes involving sensors, actuators, PLCs, and other automation components. It enables users to design, test, and optimize mechatronic systems without the need for physical prototypes, saving time and cost in the development process.",
          "The Mechatronics Assistant can be applied in learning environments to understand automation concepts, programming, control strategies, and system integration, making it a useful tool for both students and professionals in the field of mechatronics and automation engineering."
        ]
        },
      {
        "name": "Proteus",
        "image": "/New BTP/Mechatronics Laboratory/Proteus.png",
        "description": [
          "Proteus is a powerful software suite used for designing and simulating electronic circuits. The 10-user license allows multiple users to access the software, making it ideal for educational settings, workshops, and collaborative projects. It enables users to create schematic diagrams, design printed circuit boards (PCBs), and simulate the behavior of circuits before physical implementation.",
          "Proteus supports a wide range of components, including microcontrollers, sensors, and other electronic parts, and allows users to simulate both analog and digital circuits. With its intuitive interface, users can simulate real-world conditions and debug their designs virtually. The software also supports code simulation for embedded systems, enabling users to test their programs with the circuit design in real-time.",
          "Proteus is widely used in educational institutions to teach electronics, as well as in professional environments for designing and testing prototypes, thus enhancing the efficiency and accuracy of the development process."
        ]
        }
  ]
      },
      {
        "name": "Kinematics and Dynamics Laboratory",
        "equipments": [
          {
            "name": "Cam Analysis Apparatus",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Cam Analysis Apparatus.jpg",
            "description": [
              "The Cam Analysis Apparatus is used to study the working and performance characteristics of cam and follower mechanisms. This apparatus helps demonstrate the conversion of rotary motion into linear motion through the use of cams, which are widely used in various machines like internal combustion engines, automated machinery, and robotics.",
              "The equipment consists of a cam profile, a follower, and a drive mechanism, allowing students to observe the motion of the follower as the cam rotates. The apparatus can simulate different cam profiles, such as radial, cylindrical, or face cams, to observe the effects of these profiles on the follower's motion, including displacement, velocity, and acceleration.",
              "By analyzing the motion, students can gain a deeper understanding of the mechanical principles behind cam mechanisms, which are critical in designing systems for specific motion requirements. This experiment helps in the study of kinematics and dynamics for engineering applications."
            ]
            },
          {
            "name": "Moment of Inertia of Flywheel Apparatus",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Moment of Inertia of Flywheel Apparatus.jpg",
            "description": [
              "The Moment of Inertia of Flywheel Apparatus is used to demonstrate and understand the concept of moment of inertia in rotational motion. The equipment consists of a flywheel with a 20 cm diameter, which can rotate around an axis. By applying a known torque to the flywheel, students can observe the resulting angular acceleration and calculate the moment of inertia, which is a measure of the flywheel's resistance to changes in its rotational motion.",
              "The flywheel is typically connected to a motor, and the rotational speed can be measured using a tachometer. By varying the applied force and measuring the angular displacement, students can experimentally determine the moment of inertia, and study the relationship between torque, angular acceleration, and the flywheel’s mass distribution.",
              "This apparatus provides hands-on learning for understanding the fundamentals of rotational dynamics and its importance in the design of machines and mechanical systems."
            ]
            },
          {
            "name": "Static and Dynamic Balancing Apparatus",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Static and Dynamic Balancing Apparatus.jpg",
            "description": [
              "The Static and Dynamic Balancing Apparatus is used to demonstrate and study the principles of balancing rotating bodies. This equipment allows students to understand the concept of static and dynamic balancing in mechanical systems.",
              "For static balancing, the apparatus helps to balance an object when it is stationary, ensuring that the center of mass is aligned with the axis of rotation. When a body is statically balanced, it does not tilt or shift in position when placed on a surface.",
              "For dynamic balancing, the apparatus demonstrates the need for balancing when the object is rotating. In dynamic balancing, the mass distribution is adjusted to prevent vibrations during rotation. The apparatus typically includes a rotating shaft or disk, and students can place weights at different points to achieve balance. This balancing process ensures smooth rotation and reduces the risk of damage or wear in machines. It is essential for ensuring efficient operation of rotating equipment in various industrial applications."
            ]
            },
          {
            "name": "Motorized Gyroscope Apparatus",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Motorized Gyroscope Apparatus.jpg",
            "description": [
              "The Motorized Gyroscope Apparatus is used to demonstrate the working principles of a gyroscope and its applications in various mechanical systems. A gyroscope is a device that measures or maintains orientation and angular velocity based on the principles of angular momentum.",
              "This apparatus consists of a rotating wheel or disk mounted on a set of gimbals, which allow it to rotate freely in multiple directions. When the wheel is spun using a motor, the gyroscope exhibits resistance to changes in its orientation due to the conservation of angular momentum. This property is crucial in applications like navigation systems, spacecraft, and stabilizing systems.",
              "The Motorized Gyroscope Apparatus allows students to observe how the gyroscope resists tilting and precesses in response to external forces, helping them understand the concept of stability in rotating systems. It is widely used in aviation, robotics, and control systems to maintain balance and orientation."
            ]
            },
          {
            "name": "Slip and Creep Measurement Apparatus",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Slip and Creep Measurement Apparatus.jpg",
            "description": [
              "The Slip and Creep Measurement Apparatus is used to study the phenomena of slip and creep in mechanical systems, particularly in relation to the motion of wheels or belts on surfaces.",
              "Slip refers to the relative motion between two surfaces in contact, where one surface moves faster than the other. Creep, on the other hand, is the slow, gradual deformation of materials under constant stress, typically observed in rotating components like tires or pulleys over time.",
              "This apparatus consists of a rotating drum or wheel, where the specimen material (such as rubber or metal) is subjected to controlled loads and speeds. Sensors measure the amount of slip (relative motion between the surfaces) and the creep (deformation of the material) over time.",
              "The Slip and Creep Measurement Apparatus is crucial in understanding wear, friction, and material fatigue, and is used in automotive, machinery, and conveyor system designs to optimize performance and minimize energy loss."
            ]
            },
          {
            "name": "Universal Vibration Apparatus",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Universal Vibration Apparatus.jpg",
            "description": [
              "The Universal Vibration Apparatus is designed to demonstrate and study the principles of vibration in mechanical systems. It allows for the analysis of various vibration phenomena, including free and forced vibrations, resonance, and the effects of damping.",
              "The apparatus consists of a flexible beam or structure attached to a vibration source, such as an electromagnetic exciter. It typically features sensors, such as accelerometers, to measure the amplitude and frequency of vibrations. The system can be adjusted to simulate different conditions, such as varying load, damping, and stiffness, to observe their effects on vibration characteristics.",
              "By using this apparatus, students and engineers can study key concepts like natural frequency, resonance, and damping, which are crucial for understanding the behavior of structures and machinery subjected to dynamic forces. It is particularly useful in fields like mechanical engineering, civil engineering, and automotive engineering, where vibration analysis plays a critical role in design and safety."
            ]
            },
          {
            "name": "Model Board for Generation of Gear Tooth Profile",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model Board for Generation of Gear Tooth Profile",
            "description": [
              "The Model Board for Generation of Gear Tooth Profile is used to demonstrate the process of generating and analyzing gear tooth profiles, which are essential for the proper functioning of gears in mechanical systems. This equipment helps students and engineers understand the intricate process involved in gear design and manufacturing.",
              "The model board typically consists of a set of tools and templates to simulate the generation of different types of gear profiles, such as spur, helical, or bevel gears. By using a gear-cutting tool or template, the gear teeth are created by tracing the tooth profile on a workpiece. The equipment allows users to observe how the shape, size, and spacing of teeth affect gear performance, including torque transmission, efficiency, and wear resistance.",
              "This apparatus is commonly used for educational purposes, enabling learners to visually grasp how gears are formed and how their geometries impact mechanical power transmission systems."
            ]
            },
          {
            "name": "Crank and Connecting Rod Model",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Crank and Connecting Rod Model.jfif",
            "description": [
              "The Crank and Connecting Rod Model is used to demonstrate the essential components of an internal combustion engine, specifically the relationship between the crankshaft and the connecting rod. This model provides a clear visualization of how rotational motion is converted into linear motion in the engine.",
              "The equipment typically consists of a crank, connecting rod, and piston, all mounted on a base to simulate the working mechanism of an engine. When the crank is rotated, it drives the connecting rod, which moves the piston up and down. This movement simulates the working cycle of an engine, showing how power is generated and transmitted through the engine components.",
              "The Crank and Connecting Rod Model is often used in educational settings to help students understand the basic principles of engine operation and mechanical motion transmission. It is valuable for studying automotive components and machine tools, providing hands-on experience with how these critical parts function in real-world applications."
            ]
            },
          {
            "name": "Model of Crank & Slotted Lever Mechanism",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Crank & Slotted Lever Mechanism.jfif",
            "description": [
              "The Model of Crank & Slotted Lever Mechanism is used to demonstrate the working principle of a mechanical system that converts rotary motion into reciprocating motion. It is commonly found in internal combustion engines, machine tools, and various automotive applications. The mechanism consists of a crank, a slotted lever, and a ram or slider, which work together to transform the rotational movement of the crank into a linear, reciprocating motion.",
              "In this model, when the crank rotates, the slotted lever moves along a slot, causing the ram or slider to move back and forth. This motion is crucial in applications like pumps, engines, and presses, where rotational input needs to be converted into linear output.",
              "The Model of Crank & Slotted Lever Mechanism is often used in educational labs to help students understand mechanical motion conversion. It is a valuable tool for studying the design and operation of components in automotive engines and machine tools."
            ]
            },
          {
            "name": "Model of Four Bar Link Mechanism",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Four Bar Link Mechanism.jfif",
            "description": [
              "The Model of Four Bar Link Mechanism is used to demonstrate the basic principles of kinematic motion in mechanical systems. It consists of four rigid links and four rotational pairs (joints), forming a closed-loop chain. The mechanism is commonly used in automotive and machine tool applications to convert input rotational motion into desired output motion, such as reciprocating or oscillating motion.",
              "In this model, one of the links (usually the input link) is driven by an external force, causing the entire system to move. The motion of each link is determined by the length of the links and the angular velocities at the joints. The mechanism is used in applications such as steering systems, suspension systems, and robotic arms, where precise control of motion is required.",
              "The model is widely used in educational labs for teaching the principles of kinematics and analyzing the motion of different mechanical linkages in automotive and machinery systems."
            ]
            },
          {
            "name": "Model of Oscillating Cylinder Mechanism",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Oscillating Cylinder Mechanism.jfif",
            "description": [
              "The Model of Oscillating Cylinder Mechanism is used to demonstrate the functioning of a mechanical system where a cylinder undergoes oscillatory motion. This mechanism consists of a cylinder connected to a driving shaft, which produces oscillating motion, typically in a reciprocating motion pattern.",
              "In automotive and machine tool applications, this model is used to illustrate the working of engines, compressors, or other machinery where oscillating motion is crucial for operational efficiency. The oscillating cylinder mechanism is often used to simulate and understand the motion within internal combustion engines, particularly in systems like pumps or compressors, where back-and-forth motion is required to perform a specific function.",
              "The mechanism is useful for studying how forces are transmitted and how motion is converted in machines. It is widely used in educational labs for demonstrating basic principles of mechanical linkages, motion conversion, and mechanical design in automotive and machinery systems."
            ]
            },
          {
            "name": "Model of Pawl and Ratchet Motion",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Pawl and Ratchet Motion.jfif",
            "description": [
              "The Model of Pawl and Ratchet Motion is used to demonstrate the working principle of a ratchet mechanism, which allows motion in only one direction. It consists of a ratchet wheel and a pawl. The pawl engages with the teeth of the ratchet wheel, allowing it to rotate in one direction while preventing movement in the opposite direction. This mechanism is commonly used in automotive and machine tools where unidirectional motion is required, such as in hand tools like wrenches, hoists, or gear mechanisms.",
              "In automotive applications, the pawl and ratchet system can be used in starter motors, where the ratchet engages to rotate the motor in one direction but prevents reverse rotation. In machine tools, it is used in indexing mechanisms or to hold the position of a rotating component. This model is essential for understanding mechanical linkages, unidirectional motion control, and mechanical efficiency in automotive and machinery systems."
            ]
            },
          {
            "name": "Model of Peucellier Mechanism",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Peucellier Mechanism",
            "description": [
              "The Model of Peucellier Mechanism is used to demonstrate the transformation of rotary motion into straight-line motion. It consists of a series of linked rods that, when rotated, create a straight-line output motion. This mechanism is a type of four-bar linkage and is particularly useful for applications where precise linear motion is required from a rotational input.",
              "In automotive and machine tool systems, the Peucellier mechanism is used to provide linear motion for various applications, such as in actuators or mechanisms that require a specific range of motion with minimal deviation from a straight path. It is also employed in applications where space limitations make traditional linear actuators impractical. The model helps in understanding the concept of linkages, how rotary input is converted to linear output, and its role in mechanical design and motion control. It is a valuable tool for demonstrating the principles of kinematics and mechanical linkages in both automotive and industrial machinery."
            ]
            },
          {
            "name": "Model of Reciprocating Engine Mechanism",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Reciprocating Engine Mechanism.jfif",
            "description": [
              "The Model of Reciprocating Engine Mechanism is used to demonstrate the working principles of an internal combustion engine, focusing on the conversion of chemical energy into mechanical work. It showcases the fundamental components of a reciprocating engine, including the piston, crankshaft, connecting rods, and valves. The mechanism allows users to observe the linear motion of the piston and its conversion into rotational motion of the crankshaft.",
              "In automotive and machine tool applications, this mechanism is essential for understanding engine functionality and performance. It highlights the cycle of intake, compression, power, and exhaust, mimicking the operations in real engines. The model is typically used for educational purposes to explain how engine components interact, as well as to study engine efficiency, power output, and the impact of various factors on engine performance. It serves as a hands-on learning tool in automotive engineering, aiding in the understanding of the critical components and workings of reciprocating engines."
            ]
            },
          {
            "name": "Model of Whitworth Quick Return Mechanism",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Whitworth Quick Return Mechanism.jfif",
            "description": [
              "The Model of Whitworth Quick Return Mechanism is used to demonstrate the working principle of a reciprocating engine mechanism commonly employed in shaper machines. It consists of a driving wheel, a ram, and a driving crank, designed to convert rotary motion into reciprocating motion. The mechanism is characterized by its 'quick return' feature, where the return stroke is faster than the forward stroke. This is achieved by the eccentric crank and slider arrangement, which shortens the return path.",
              "In automotive and machine tool applications, this mechanism is important for understanding the operation of shaper machines, which are used for cutting and shaping parts in manufacturing. The model helps visualize the motion of the ram and understand how the quick return feature is beneficial in reducing the cycle time of the tool. It is commonly used for educational purposes in mechanical engineering labs to demonstrate kinematic principles and the functionality of the Whitworth mechanism in various machinery."
            ]
            },
          {
            "name": "Model of Single Stage Spur Gears with Intermediate Gear",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Single Stage Spur Gears with Intermediate Gear",
            "description": [
              "The Model of Single Stage Spur Gears with Intermediate Gear is used to demonstrate the functioning and operation of gears in mechanical systems. It consists of a pair of spur gears, one driving and one driven, with an intermediate gear placed between them to transmit motion. The primary purpose of this model is to show how gears mesh to transfer rotary motion and power from one shaft to another.",
              "This model is important for understanding basic gear train configurations and how the torque and speed are altered in a mechanical system. The gear teeth in spur gears are designed to mesh smoothly, and the intermediate gear helps change the direction of rotation while maintaining the gear ratio. It is commonly used in automotive and machine tool applications to simulate power transmission and illustrate the principles of gear ratios, torque conversion, and rotational motion. The model is widely used in engineering labs to teach fundamental gear mechanisms."
            ]
            },
          {
            "name": "Model of Three Stage Spur Gears",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Three Stage Spur Gears.jfif",
            "description": [
              "The Model of Three Stage Spur Gears is used to demonstrate the functioning and operation of multiple gear stages in mechanical power transmission systems. It consists of three pairs of spur gears arranged sequentially, where each stage consists of a driving gear, an intermediate gear, and a driven gear. The primary purpose of this model is to showcase how power is transferred across multiple stages to alter the speed and torque in a mechanical system.",
              "This setup is important for understanding complex gear train configurations, where each stage contributes to the overall gear ratio. It helps to demonstrate how multiple gears can be used to achieve specific output speeds and torques in machines, automotive systems, and industrial equipment. The model also shows how gear meshing works across several stages, and it is commonly used in educational settings to teach concepts such as gear ratios, torque multiplication, and the principles of mechanical power transmission."
            ]
            },
          {
            "name": "Model of Double Stage Helical Gear (Herringbone Gear BIG)",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Model of Double Stage Helical Gear (Herringbone Gear BIG).jfif",
            "description": [
              "The Model of Double Stage Helical Gear (Herringbone Gear BIG) is designed to demonstrate the operation and benefits of helical gears in power transmission systems, specifically focusing on the double-stage arrangement and herringbone tooth configuration. This model showcases the transfer of motion between two sets of gears with inclined teeth, arranged in a way that the gears mesh smoothly and provide high torque transmission with reduced noise.",
              "The herringbone gear setup features two helical gears with teeth that form a V-shape, eliminating axial thrust forces and allowing for smoother and more efficient power transmission. This model is typically used for educational and demonstration purposes in understanding advanced gear systems used in automotive and industrial machinery. It helps in understanding the advantages of using helical gears, such as reduced wear, high load capacity, and quieter operation compared to spur gears. The double-stage configuration further demonstrates how power is transmitted over multiple gear stages in complex machines."
            ]
            },
          {
            "name": "Demonstrative Gear Models",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Gears.jfif",
            "description": [
              "The Demonstrative Gear Models are designed to illustrate the operation and functionality of various types of gears used in automotive and machine tool systems. These models provide hands-on demonstrations of different gear types and their applications in power transmission. The types included are:",
              
              "Rack and Quadrant Gear: Converts rotational motion into linear motion, used in steering mechanisms.",
              
              "Two-Stage Spur Gear: Shows the step-by-step transfer of motion through two gears, demonstrating gear reduction.",
              
              "Bevel Gear: Used to transmit motion between intersecting shafts, typically at 90°.",
              
              "Helical Gear: Features angled teeth for smoother, quieter operation, used in high-torque applications.",
              
              "Spiral Gear: A variation of helical gears with a curved tooth design, used for high-efficiency gear systems.",
              
              "Spur Gear: Common gear type with straight teeth, transferring motion between parallel shafts.",
              
              "Worm Gear: Provides high torque with low-speed reductions, used in tight spaces.",
              
              "Epicycle Gear (Sun and Planet Type): Demonstrates complex gear systems, often used in automatic transmissions.",
              
              "These models are used for educational purposes to help students understand gear design, meshing principles, and their practical applications."
            ]
            },
          {
            "name": "Digital Stroboscope",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Digital Stroboscope.jfif",
            "description": [
              "The Digital Stroboscope is used to measure the rotational speed or RPM (Revolutions Per Minute) of rotating objects, such as motors, shafts, or gears. It operates by emitting a flashing light at a frequency that matches the rotation speed of the object. By adjusting the flash rate, the user can visually 'freeze' the motion of the rotating object, making it appear stationary at specific intervals. The RPM is determined by the frequency at which the strobe light flashes, which is then displayed on the device's digital readout.",
              "This tool is useful in various applications, including mechanical, automotive, and manufacturing industries, where precise speed measurement is required without physically contacting the rotating parts. It is often employed for maintenance, troubleshooting, and quality control purposes to ensure that machinery is operating at the correct speed."
            ]
            },
          {
            "name": "Digital Tachometer",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Digital Tachometer.jfif",
            "description": [
              "The Digital Tachometer is a device used to measure the rotational speed of an object, typically in revolutions per minute (RPM). It operates by detecting the motion of a rotating surface or shaft, using optical, magnetic, or mechanical sensors to capture the speed. When the tachometer is pointed at a rotating object, it counts the number of revolutions and converts this information into a digital readout, displaying the RPM on its screen.",
              "This tool is commonly used in various industries for monitoring the performance of machinery, such as motors, engines, and conveyors, ensuring they operate within optimal speed ranges. Digital tachometers are preferred over analog models for their accuracy, ease of use, and ability to provide clear, precise measurements. It is widely employed in mechanical maintenance, diagnostics, and research applications where precise speed control is critical."
            ]
            },
          {
            "name": "Clutch (Claw Clutch, Conical Friction Clutch, Plate Clutch, Centrifugal Clutch)",
            "image": "/New BTP/Kinematics and Dynamics Laboratory/Clutch.jfif",
            "description": [
              "A Clutch is a mechanical device used to connect or disconnect two rotating shafts, typically in a vehicle or machinery, allowing for smooth transmission of power between them. There are several types of clutches, each serving a specific function:",
              "Claw Clutch: Uses interlocking claws or teeth to engage and disengage power transmission. It is often used in manual machinery where precise control is required.",
              "Conical Friction Clutch: Features conical surfaces that press together to create friction, enabling power transfer. It's commonly used in automotive applications.",
              "Plate Clutch: Consists of multiple friction plates that engage to transmit power. It's widely used in automotive systems for smooth gear changes.",
              "Centrifugal Clutch: Uses centrifugal force to engage the clutch when the engine speed reaches a certain point. It is commonly used in go-karts, lawnmowers, and other small engines.",
              "Clutches are essential for controlling power flow, ensuring smooth starts and stops in machinery and vehicles."
            ]
            }
        ]
      },
      {
        "name": "Heat Transfer Laboratory",
        "equipments": [
          {
            "name": "Heat Transfer in Natural Convection Apparatus",
            "image": "/New BTP/Heat Transfer Laboratory/Heat Transfer in Natural Convection Apparatus.jpg",
            "description": [
              "The Heat Transfer in Natural Convection apparatus is designed to study and analyze the process of heat transfer in natural convection. In natural convection, heat transfer occurs due to the movement of fluid (air or liquid) induced by temperature differences, without any external force like a fan or pump. The system typically consists of a heated vertical surface, around which the fluid (such as air) circulates as it is heated.",
              "This setup allows students to observe the relationship between the surface temperature, fluid temperature, and heat transfer rate. By adjusting parameters such as the surface temperature and measuring the temperature variations in the surrounding fluid, users can calculate the convective heat transfer coefficient. This experiment aids in understanding concepts like Rayleigh number, Nusselt number, and Grashof number, all critical for analyzing convective heat transfer in natural systems such as the cooling of buildings or the human body."
            ]
            },
          {
            "name": "Heat Transfer in Forced Convection Apparatus",
            "image": "/New BTP/Heat Transfer Laboratory/Heat Transfer in Forced Convection Apparatus.jpg",
            "description": [
              "The Heat Transfer in Forced Convection apparatus is designed to study and analyze the process of heat transfer when a fluid (liquid or gas) is forced over a surface, typically using a fan or pump. In forced convection, the heat transfer rate is enhanced by the forced movement of the fluid, which increases the convective heat transfer coefficient.",
              "The setup typically consists of a heated surface or tube through which a fluid is passed at a controlled flow rate. Temperature sensors are placed along the surface and in the fluid to measure temperature gradients and determine the heat transfer rate. By adjusting parameters such as fluid velocity, surface temperature, and flow rate, users can observe the effects on heat transfer efficiency. This experiment helps in understanding the principles of forced convection and is crucial for applications such as heat exchangers, cooling systems, and air conditioning systems, where fluid movement is actively controlled to enhance heat transfer."
            ]
            },
          {
            "name": "Parallel Flow/Counter Flow Heat Exchanger",
            "image": "/New BTP/Heat Transfer Laboratory/Counter Flow Heat Exchanger.jpg",
            "description": [
              "The Parallel Flow/Counter Flow Heat Exchanger is used to study the heat transfer phenomena in two common heat exchanger configurations: parallel flow and counterflow. In both setups, two fluids flow through separate channels, allowing for the exchange of heat between them. The key difference is the direction of fluid flow.",
              "In the parallel flow arrangement, both fluids flow in the same direction, while in the counterflow arrangement, the fluids flow in opposite directions. This experiment helps in analyzing the temperature variation and heat transfer efficiency in each type of configuration.",
              "The apparatus typically consists of two fluid loops—one for the hot fluid and the other for the cold fluid—passing through a series of tubes or plates. By measuring inlet and outlet temperatures, flow rates, and heat transfer rates, students can compare the performance of parallel and counterflow heat exchangers. This study is critical for designing efficient heat exchangers in industrial applications."
            ]
            },
          {
            "name": "Stefan Boltzmann’s Apparatus",
            "image": "/New BTP/Heat Transfer Laboratory/Stefan Boltzmann's Apparatus.jpg",
            "description": [
              "Stefan Boltzmann’s Apparatus is used to study radiation heat transfer, particularly focusing on the behavior of black bodies and the effect of temperature on radiation. According to the Stefan-Boltzmann law, the total energy radiated per unit surface area of a black body is proportional to the fourth power of its absolute temperature.",
              "The apparatus typically consists of a black body cavity or a hemisphere, a heat source, and sensors to measure the temperature and the radiated energy. By adjusting the temperature of the black body and measuring the emitted radiation, the apparatus allows the demonstration of the relationship between temperature and radiation intensity.",
              "The experiment involves calculating the Stefan-Boltzmann constant and analyzing how variations in the temperature of the hemisphere affect the heat radiation emitted. This helps in understanding the fundamentals of heat transfer through radiation and its importance in various engineering applications, including thermal management and energy systems."
            ]
            },
          {
            "name": "Emissivity Measurement Apparatus",
            "image": "/New BTP/Heat Transfer Laboratory/Emissivity Measurement Apparatus.jpg",
            "description": [
              "The Emissivity Measurement Apparatus is used to study radiation heat transfer by comparing the emissivity of different materials, specifically focusing on a black plate and a test plate. Emissivity is a measure of a material's ability to emit infrared radiation, and it is a key factor in heat transfer through radiation.",
              "The apparatus typically consists of a black plate with a known high emissivity and a test plate whose emissivity is to be measured. Heat is applied to both plates, and their surface temperatures are monitored using thermocouples or infrared sensors. By measuring the radiated heat and the temperature difference, the apparatus allows for the determination of the emissivity of the test plate.",
              "This experiment helps in understanding how different materials absorb and emit radiation, which is crucial for designing efficient heat transfer systems, such as radiators, heat exchangers, and thermal insulation in various engineering applications."
            ]
            },
          {
            "name": "Thermal Conductivity of Metal Rod Apparatus",
            "image": "/New BTP/Heat Transfer Laboratory/Thermal Conductivity of Metal Rod Apparatus.jpg",
            "description": [
              "The Thermal Conductivity of Metal Rod apparatus is used to study heat transfer through conduction in a metal rod. This experiment helps determine the thermal conductivity of different materials by observing how heat flows through them.",
              "The setup typically consists of a metal rod with known dimensions, two temperature sensors (typically thermocouples), and a heat source. One end of the metal rod is heated, and the other end is kept at a lower temperature, creating a temperature gradient along the rod. The temperature at both ends of the rod is measured, and from the observed temperature difference, the rate of heat transfer is calculated.",
              "By applying Fourier's law of heat conduction, which relates the heat transfer rate to the material’s thermal conductivity, this experiment allows for the determination of the metal rod's thermal conductivity. This information is crucial in various engineering applications, such as the design of heat exchangers and thermal management systems."
            ]
            },
          {
            "name": "Thermal Conductivity of Liquids Apparatus",
            "image": "/New BTP/Heat Transfer Laboratory/Thermal Conductivity of Liquids Apparatus.jpg",
            "description": [
              "The Thermal Conductivity of Liquids apparatus is used to study the heat transfer properties of liquids and determine their thermal conductivity. This experiment involves heating a liquid within a controlled system and measuring how efficiently it conducts heat.",
              "The setup typically consists of a cylindrical container filled with a liquid, with a heating element at the bottom to supply heat and temperature sensors at various points in the liquid. The system is designed to maintain a steady heat input, and the temperature difference between different points in the liquid is measured.",
              "By using Fourier’s law of heat conduction, the thermal conductivity of the liquid can be calculated based on the rate of heat transfer and the observed temperature gradient. This experiment is essential for understanding how liquids transfer heat, which is crucial in the design and optimization of cooling systems, heat exchangers, and other applications involving liquid heat transfer."
            ]
            },
          {
            "name": "Heat Pipe Demonstrator",
            "image": "/New BTP/Heat Transfer Laboratory/Heat Pipe Demonstrator.jpg",
            "description": [
              "The Heat Pipe Demonstrator is designed to showcase the exceptional thermal conductivity of heat pipes, which are highly efficient thermal transfer devices. It demonstrates how heat pipes utilize phase change materials to transfer heat over long distances with minimal temperature difference.",
              "In this apparatus, heat is applied to one end of the heat pipe, causing the working fluid inside to evaporate. The vapor then travels to the cooler end, where it condenses and releases the absorbed heat. The condensed liquid returns to the hot end through capillary action, and the cycle repeats.",
              "The system allows for the comparison of heat transfer efficiency between a heat pipe and other materials with high conductivity, such as copper. By using temperature sensors at various points along the heat pipe, the demonstrator illustrates the heat pipe’s ability to transfer heat more effectively than traditional conductors, making it ideal for use in electronics, spacecraft, and energy systems."
            ]
            },
          {
            "name": "Condensation in Drop Wise/Film Wise Apparatus",
            "image": "/New BTP/Heat Transfer Laboratory/Condensation in Drop Wise Film Wise Apparatus.jpg",
            "description": [
              "This equipment is used to study the condensation process in two distinct forms: dropwise and filmwise condensation. By using a mini steam boiler, the system generates steam, which is condensed on a cold surface under controlled conditions. The steam condenses either in the form of discrete drops (dropwise condensation) or as a continuous film (filmwise condensation), depending on the surface characteristics and temperature.",
              "The apparatus includes a pressure release valve to control and regulate the steam pressure, ensuring consistent experimental conditions. Temperature sensors placed along the surface measure the heat transfer rate.",
              "By analyzing the rate of condensation and the heat transferred from the steam to the cooling surface, the equipment helps determine the overall heat transfer coefficient for both dropwise and filmwise condensation. This experiment is crucial for understanding heat transfer in applications like heat exchangers, condensers, and cooling systems."
            ]
            },
          {
            "name": "Test Rig to Check CHF (Critical Heat Flux)",
            "image": "/New BTP/Heat Transfer Laboratory/Test Rig to Check CHF.jpg",
            "description": [
              "This equipment is designed to determine the Critical Heat Flux (CHF) point for a given metal wire, particularly when it is coated with nanostructured surfaces. The CHF is the point at which the surface experiences a dramatic drop in heat transfer efficiency, transitioning from nucleate boiling to film boiling. The test rig applies a controlled heat flux to the metal wire and gradually increases the heat input until the CHF point is reached.",
              "The nanostructured surface of the metal wire enhances heat transfer characteristics, which can delay or shift the CHF point. By monitoring the temperature and heat flux, along with other parameters such as surface temperature and boiling behavior, the rig helps evaluate the performance of nanostructured surfaces in enhancing the heat transfer capabilities of the material.",
              "This setup is critical for optimizing cooling systems in high-performance applications like electronics, power plants, and aerospace engineering."
            ]
            },
          {
            "name": "Two-Phase Heat Transfer Apparatus (Boiling Heat Transfer Unit)",
            "image": "/New BTP/Heat Transfer Laboratory/Two-Phase Heat Transfer Apparatus.jpg",
            "description": [
              "The Two Phase Heat Transfer Apparatus, also known as the Boiling Heat Transfer Unit, is designed to study the two-phase heat transfer phenomena, specifically focusing on the pool boiling of Methylene Chloride. This equipment is used to analyze the behavior of heat transfer during phase changes, from liquid to vapor, in a controlled environment.",
              "In this apparatus, Methylene Chloride is heated in a pool, and its boiling characteristics are observed as heat is applied. The system monitors various parameters like temperature, pressure, and heat flux, to evaluate the efficiency of heat transfer during the boiling process.",
              "By studying the two-phase heat transfer, the apparatus helps understand the impact of factors such as surface temperature, liquid properties, and boiling regime on heat transfer efficiency. This equipment is particularly useful in industries like heat exchangers, refrigeration, and power generation, where efficient heat transfer is crucial for system performance."
            ]
          },
          {
            "name": "Data Acquisition System (16 Channel)",
            "image": "/New BTP/Heat Transfer Laboratory/Data Acquisition System.jfif",
            "description": [
              "The 16-Channel Data Acquisition System is used to measure and record physical characteristics such as temperature, pressure, humidity, and other variables from multiple sensors simultaneously. It features 16 input channels, allowing for the monitoring of multiple parameters in real-time.",
              "This system is used in various applications like research, testing, and industrial process monitoring. Each channel can be connected to a different sensor to capture data from different locations or measurement types. The acquired data is then processed, analyzed, and stored for further interpretation.",
              "The system is widely employed in fields such as mechanical testing, environmental monitoring, and automation, where precise and continuous data collection is necessary. The 16 channels provide the advantage of simultaneous data logging from multiple sources, improving efficiency and reducing the need for multiple separate systems."
            ]
            },
          {
            "name": "Flow Metering System",
            "image": "/New BTP/Heat Transfer Laboratory/Flow Metering System.jpg",
            "description": [
              "The Flow Metering System is designed to measure the volume or mass flow rate of a liquid passing through a pipeline or a system. It is commonly used in industries such as chemical processing, water treatment, oil and gas, and food production to ensure accurate measurement and control of fluid flow.",
              "The system typically consists of a flow meter, sensors, and controllers that continuously monitor the flow rate. Depending on the type of flow meter (e.g., turbine, ultrasonic, electromagnetic, or positive displacement), it measures either the volumetric flow rate (volume per unit time) or the mass flow rate (mass per unit time).",
              "By integrating the flow meter into a process system, operators can monitor, regulate, and record the amount of fluid moving through the system. This is crucial for maintaining product quality, ensuring operational efficiency, and meeting regulatory requirements."
            ]
            },
          {
            "name": "Refrigeration Test Rig (Charged with Nano-Refrigerant)",
            "image": "/New BTP/Heat Transfer Laboratory/Refrigeration Test Rig.jpg",
            "description": [
              "The Refrigeration Test Rig charged with nano-refrigerant is used to conduct experiments and demonstrate the process of cooling, specifically the refrigeration cycle, using nano-enhanced refrigerants. This setup allows for the study of the cooling process of water or other fluids, while investigating the impact of nano-refrigerants on system performance.",
              "The rig includes components like a compressor, condenser, expansion valve, and evaporator, which are designed to work with nano-refrigerants that have enhanced thermal conductivity and improved heat transfer properties. By charging the system with nano-refrigerants, the rig allows users to evaluate the efficiency, cooling capacity, and energy consumption compared to conventional refrigerants.",
              "Students and researchers use this equipment to understand refrigeration cycles, the behavior of different refrigerants under varying conditions, and the potential advantages of nano-refrigerants in improving cooling performance and reducing environmental impact. The rig helps in experimenting with various system configurations and operational parameters."
            ]
            },
          {
            "name": "Test Rig on Boiling Heat Transfer",
            "image": "/New BTP/Heat Transfer Laboratory/Boiling Heat Transfer Test Rig.jpg",
            "description": [
              "The Test Rig on Boiling Heat Transfer is designed to study and analyze the heat transfer process during boiling. This equipment allows users to investigate the boiling phenomenon, specifically the heat transfer that occurs when a liquid is heated to its boiling point. It is commonly used in research and educational settings to explore the thermal performance of liquids during phase change from liquid to vapor.",
              "The rig consists of a heated surface (typically a metal plate or tube) where the liquid is placed. As heat is applied, the liquid boils, and the heat transfer coefficient is measured. The apparatus typically includes temperature sensors, pressure gauges, and a flow meter to monitor the changes during the boiling process.",
              "This test rig is used to study factors such as heat flux, nucleate boiling, film boiling, and the effect of surface properties on heat transfer performance. It is valuable for understanding thermal management in various industrial applications like heat exchangers and cooling systems."
            ]
            },
          {
            "name": "Jet Impingement Cooling Test Rig",
            "image": "/New BTP/Heat Transfer Laboratory/Jet Impingement Cooling Test Rig.jpg",
            "description": [
              "The Jet Impingement Cooling Test Rig is designed to study the cooling efficiency of fluid jet impingement on surfaces. It is used to enhance temperature uniformity and optimize heat dissipation in applications like electronic cooling, industrial processes, and aerospace systems. The rig operates by directing high-speed fluid jets (usually air or water) onto a heated surface, allowing for precise control of jet velocity, pressure, and flow rate.",
              "The equipment typically consists of a nozzle that directs the fluid onto the target surface, along with temperature sensors to monitor heat transfer and temperature distribution. By adjusting parameters such as jet angle, flow rate, and nozzle design, the rig helps study how these factors affect the cooling performance and uniformity of the surface temperature.",
              "This setup is commonly used in research and development for applications requiring efficient heat management, where maintaining a uniform temperature is crucial for system performance and longevity."
            ]
            },
          {
            "name": "Refrigerated/Heating Circulator",
            "image": "/New BTP/Heat Transfer Laboratory/Refrigerated Heating Circulator.jpg",
            "description": [
              "The Refrigerated / Heating Circulator is a versatile temperature control system used to maintain precise thermal conditions for cooling or heating applications in laboratory and industrial settings. It is commonly used for experiments and processes requiring stable temperature regulation, such as in heat transfer studies, materials testing, and temperature-sensitive chemical reactions.",
              "The circulator functions by circulating a liquid through a closed loop, either heating or cooling the liquid to a desired set point. The system incorporates a refrigeration unit for cooling and a heating element for warming the liquid, allowing for accurate temperature control across a wide range of temperatures. The liquid is typically pumped through the system to ensure consistent and uniform temperature distribution.",
              "This equipment is commonly used in conjunction with other laboratory devices such as reactors, calorimeters, or heat exchangers, providing a controlled environment for thermal testing and maintaining stability in systems sensitive to temperature variations."
            ]
            },
          {
            "name": "Ultrasonic Liquid Processor",
            "image": "/New BTP/Heat Transfer Laboratory/Ultrasonic Liquid Processor.jpg",
            "description": [
              "The Ultrasonic Liquid Processor is an advanced device used to agitate or homogenize particles in a liquid solution by utilizing high-frequency sound waves. It operates by emitting ultrasonic waves through a liquid medium, which generates high-energy sound vibrations. These vibrations create rapid pressure changes that cause cavitation, leading to the formation of microscopic bubbles that implode and produce intense shear forces. These forces help break down particles, promote mixing, and improve the dispersion of substances in the liquid.",
              "This equipment is widely used in laboratories and industries for tasks like emulsification, particle size reduction, and accelerating chemical reactions. It is also employed in processes such as sample preparation, extraction, and homogenization of suspensions or solutions. The ultrasonic liquid processor is particularly effective in breaking down tough materials, such as cells in biological applications, and in improving the efficiency of reactions and mixing in various chemical, pharmaceutical, and food processing applications."
            ]
            },
          {
            "name": "Micro Pump",
            "image": "/New BTP/Heat Transfer Laboratory/Micro Pump.jpg",
            "description": [
              "A micro pump is a miniature fluid delivery device designed to precisely control and transport small volumes of liquids or gases. These pumps are typically used in applications that require accurate, low-flow fluid movement at a micro-scale, such as in medical devices, laboratory settings, and precision manufacturing processes.",
              "Micro pumps can be used for a variety of functions including dosing, mixing, or circulating fluids in systems such as microfluidic devices, inkjet printers, fuel delivery systems, and analytical instruments. They work by using different principles, such as piezoelectric, electrostatic, or diaphragm-based mechanisms, to create the necessary pressure to move fluids.",
              "In laboratory environments, micro pumps are commonly employed in chemical analysis, biosensing, and diagnostic testing, where high precision and small fluid volumes are crucial. Due to their compact size, these pumps are also ideal for portable and wearable applications in the medical and pharmaceutical industries."
            ]
            }
        ]
      },
      {
        "name": "Computer Aided Design (CAD) Lab",
        "equipments": [
          {
            "name": "VI Rail Education License",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/VI Rail education license.jfif",
            "description": ["The VI Rail Education License is a software tool used primarily for research and simulation in the area of high-speed trains and rail transport. It allows students and researchers to design, analyze, and simulate railway systems, with a focus on high-speed rail networks. The software offers advanced features for modeling the dynamics of trains, track infrastructure, signaling systems, and environmental interactions, enabling comprehensive analysis of performance, safety, and efficiency. It supports various parameters such as speed, braking distance, and track geometry, making it essential for optimizing rail system designs. By using the VI Rail Education License, users can conduct experiments, perform simulations under different conditions, and evaluate the impact of modifications to train and rail systems. This helps in advancing research in rail transportation and developing safer and more efficient high-speed train technologies."
        ]},
            {
            "name": "SolidWorks Education Edition Network (2012-13)",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/SolidWorks Education Edition Network (2012-13).jfif",
            "description": [
              "The SolidWorks Education Edition Network 2012-13 is a comprehensive CAD software used for creating 2D drawings, 3D modeling, drafting, and assembly designs. It is specifically tailored for educational purposes, offering students and instructors access to powerful design tools commonly used in engineering and product development. The software enables users to create precise mechanical and industrial models, design assemblies, and simulate real-world physical behaviors, such as motion and stress analysis. It also facilitates the creation of detailed technical drawings with annotations, dimensions, and tolerances, which are crucial for manufacturing.",
              "The network version allows multiple users to access the software simultaneously across different workstations in an educational institution, making it ideal for classroom and lab environments. SolidWorks helps students develop skills in product design, visualization, and simulation, providing a hands-on learning experience in CAD and engineering design principles."
            ]
            },
          {
            "name": "ANSYS Academic Research (Mechanical & CFD)",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/ANSYS Academic Research Mechanical.jfif",
            "description": [
              "ANSYS Academic Research Mechanical & CFD is a powerful simulation software used for modeling, analysis, and simulation of mechanical structures and fluid dynamics. It is widely used in educational and research settings to simulate and optimize designs in fields like mechanical, aerospace, and civil engineering. The software provides tools for structural analysis, including stress, strain, vibration, and thermal analysis, helping students and researchers understand material behavior under different conditions. It also offers computational fluid dynamics (CFD) capabilities, allowing users to simulate fluid flow, heat transfer, and other fluid-related phenomena in various models.",
              "ANSYS enables the testing of complex systems and structures in a virtual environment before physical prototypes are made, saving time and resources. By using this software, students can gain hands-on experience in modeling real-world engineering problems, conduct simulations, and analyze results, enhancing their understanding of mechanics and fluid dynamics."
            ]
            },
          {
            "name": "AVL BOOST",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/AVL BOOST.jfif",
            "description": [
              "AVL BOOST is a simulation software used for modeling and analyzing the performance of Internal Combustion (IC) engines. It provides advanced tools for simulating engine behavior, including thermodynamics, fluid dynamics, combustion processes, and emissions. The software allows engineers and researchers to design, optimize, and test IC engines virtually before building physical prototypes, significantly reducing development time and costs.",
              "AVL BOOST offers detailed simulations of engine performance under various operating conditions, including fuel efficiency, power output, and pollutant emissions. It helps in analyzing and optimizing engine components such as cylinders, pistons, valves, and exhaust systems. The software also supports multi-domain modeling, allowing users to integrate engine components with other systems like vehicle dynamics and powertrains for a comprehensive analysis.",
              "Used in both academic and industry research, AVL BOOST aids in educating students about engine design and performance while also enabling the development of more efficient, eco-friendly internal combustion engines."
            ]
            },
          {
            "name": "AVL CRUISE",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/AVL CRUISE.jfif",
            "description": [
              "AVL CRUISE is a comprehensive simulation software used for modeling and analyzing vehicle dynamics and performance. It is designed to simulate various vehicle systems, including powertrains, drivetrains, and vehicle chassis, to evaluate overall performance, fuel efficiency, emissions, and handling characteristics. AVL CRUISE allows engineers and researchers to model a vehicle’s behavior under different operating conditions, providing insights into factors such as energy consumption, acceleration, top speed, and ride comfort.",
              "The software supports multi-domain modeling, integrating mechanical, electrical, and fluid systems to simulate the interaction between the engine, transmission, suspension, and aerodynamics. This allows for optimization of the vehicle design for factors like fuel economy, performance, and emissions reduction.",
              "AVL CRUISE is widely used in both industry and academia for designing and optimizing vehicles before physical testing, reducing development time, costs, and improving overall vehicle performance. It is also used for educational purposes to teach students about advanced vehicle systems and simulations."
            ]
            },
          {
            "name": "MATLAB (MathWorks)",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/MATLAB (MathWorks).jfif",
            "description": [
              "Matlab (MathWorks) is a powerful software platform used for modeling, simulation, and analysis of mechanical, mechatronics, and automotive systems. It combines computation, visualization, and programming within an intuitive environment, making it widely used in both research and education. Engineers and researchers use Matlab to simulate and analyze dynamic systems, develop algorithms, and visualize complex data.",
              "In mechanical and mechatronics applications, Matlab is used to model system behaviors, including control systems, robotics, thermal systems, and vibrations. For automotive systems, Matlab supports the design and simulation of powertrains, fuel systems, and performance analysis. Its robust toolboxes, like Simulink, enhance the capability to simulate complex systems and test various scenarios without physical prototypes.",
              "Matlab allows for iterative design and optimization, reducing development time and costs. It also integrates well with other engineering tools, making it a versatile choice for multidisciplinary applications in mechanical and automotive engineering. Its flexibility makes it ideal for both academia and industry."
            ]
            },
          {
            "name": "AutoCAD Education Version (2018)",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/AutoCad Education Version2018.jfif",
            "description": [
              "AutoCAD Education Version 2018 is a widely used commercial software application for computer-aided design (CAD) and drafting. It allows users to create precise 2D and 3D drawings, making it an essential tool for engineers, architects, and designers. In the educational version, students and instructors can access the full functionality of AutoCAD, which includes tools for creating detailed floor plans, mechanical parts, electrical diagrams, and more.",
              "AutoCAD is used for designing and drafting in various fields, such as architecture, mechanical engineering, civil engineering, and electrical engineering. Users can create accurate blueprints, technical drawings, and models, incorporating a range of features such as layers, dimensions, annotations, and 3D modeling capabilities.",
              "The software’s ease of use, precision, and extensive toolset make it ideal for both beginner and advanced users. It also supports collaboration and integration with other design tools, enhancing workflow efficiency for teams working on complex projects."
            ]
            },
          {
            "name": "IPG CarMaker",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/IPG Car Maker.jfif",
            "description": [
              "IPG Car Maker is a sophisticated simulation software used for research in vehicle dynamics, focusing on the performance and behavior of vehicles under various conditions. It enables engineers and researchers to model and simulate the dynamics of vehicles in a virtual environment, allowing them to analyze factors such as handling, ride comfort, and stability.",
              "The software is extensively used in automotive engineering for designing, testing, and optimizing vehicle systems. It simulates real-world driving scenarios, including different terrains, road conditions, and driving maneuvers, to assess how a vehicle will perform. Researchers can adjust parameters such as suspension, tire characteristics, and aerodynamics to evaluate their impact on vehicle dynamics.",
              "IPG Car Maker is used in the development of various vehicle components, from suspension systems to advanced driver assistance systems (ADAS). It helps reduce the need for physical prototypes, saving time and costs while providing valuable insights into vehicle performance before production."
            ]
            },
          {
            "name": "TRNSYS",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/TRNSYS.jfif",
            "description": [
              "TRNSYS is a versatile simulation software primarily used in renewable energy engineering and building simulation. It is widely employed to model and simulate energy systems, particularly in the context of passive and active solar design. TRNSYS allows engineers and researchers to simulate the thermal performance of buildings, energy-efficient systems, and renewable energy technologies such as solar, wind, and geothermal systems. The software can model various aspects of energy flow, including heating, cooling, and electricity generation. It is used to evaluate the effectiveness of energy-saving solutions, optimize system designs, and predict energy consumption patterns.",
              "TRNSYS offers a modular approach, enabling users to customize simulations by combining various components such as solar collectors, storage tanks, HVAC systems, and lighting controls. It is extensively utilized in the design and analysis of sustainable buildings and energy systems to promote environmental sustainability and reduce energy costs."
            ]
            },
          {
            "name": "ETAS",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/ETAS.jfif",
            "description": [
              "ETAS is a comprehensive suite of tools used for automotive electronics, primarily focusing on the development and testing of embedded systems in vehicles. It is utilized for UG, PG, and research purposes in automotive engineering, specifically for systems related to engine control units (ECUs), automotive networks, and diagnostic applications. ETAS provides hardware and software solutions to model, simulate, and validate automotive electronic systems. It enables engineers to perform real-time simulation, calibration, and testing of embedded systems, ensuring the performance, reliability, and safety of vehicle electronics.",
              "With ETAS, users can interface with ECUs, monitor their operations, and optimize performance through precise calibration. The platform is widely used in automotive electronics labs for tasks such as ECU programming, functional testing, and signal analysis, making it an essential tool for automotive research and development."
            ]
            },
          {
            "name": "VECTOR",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/Vector.png",
            "description": [
              "VECTOR is a software and hardware tool used to address the complexities of embedded software testing in automotive electronics. It provides a comprehensive suite of solutions for developing, testing, and optimizing embedded software in automotive control units (ECUs). VECTOR tools are primarily used in automotive electronics labs to simulate, test, and validate ECUs, ensuring their functionality and performance under different operating conditions. It supports the development of communication protocols like CAN, LIN, and Ethernet, which are essential for automotive systems.",
              "VECTOR enables real-time data logging, monitoring, and diagnostics to evaluate the interaction between various electronic components within a vehicle. By facilitating the testing of embedded software, it helps engineers identify and resolve issues such as communication errors, software bugs, and performance bottlenecks. This tool is integral for improving the quality, safety, and reliability of automotive electronics in both prototype and production vehicles."
            ]
            },
          {
            "name": "ADAMS",
            "image": "/New BTP/Computer Aided Design (CAD) Laboratory/ADAMS.jfif",
            "description": [
              "ADAMS is a powerful software used by engineers to study the dynamics of moving parts and analyze how loads and forces are distributed throughout mechanical systems. This tool allows users to create simulations of mechanical assemblies, helping them understand the behavior of parts and components under various operating conditions. By using ADAMS, engineers can model the movement, forces, and interactions between parts, providing valuable insights into system performance, efficiency, and safety.",
              "The software integrates with Finite Element Analysis (FEA) to allow detailed stress and deformation analysis of individual components within a dynamic system. It is widely used in fields like automotive, aerospace, and robotics for tasks such as optimization of mechanical designs, vibration analysis, and motion prediction. ADAMS enables faster product development by reducing the need for physical prototypes, allowing for cost-effective and efficient testing of designs before manufacturing."
            ]
            }
        ]
      },
      {
        "name": "Material Characterization Lab",
        "equipments": [
          {
            "name": "Computerized Universal Testing Machine (Spec. 60T)",
            "image": "/New BTP/Material Characterization Laboratory/Computerized Universal Testing Machine.JPG",
            "description": [
              "The Computerised Universal Testing Machine (UTM), Specification 60T, is an advanced instrument used to determine the mechanical properties of materials, including tensile strength, compressive strength, and bending strength. With a maximum capacity of 60 tons, it is designed to handle a wide range of materials such as metals, polymers, and composites.",
              "This machine operates with a computerized control system, allowing precise measurement and real-time monitoring of forces applied to a test specimen. The material is mounted between the grips or supports, and a controlled load is applied. Sensors and software record the material's response, providing data on parameters like stress, strain, and breaking point. The UTM is widely utilized in material science research, quality control, and industrial applications. It enables engineers to evaluate the performance of materials under different loading conditions, ensuring they meet safety and durability standards for various engineering and manufacturing purposes."
            ]
            },
          {
            "name": "Brinell Hardness Tester",
            "image": "/New BTP/Material Characterization Laboratory/Brinell Hardness Tester .jpg",
            "description": [
              "The Brinell Hardness Tester is a device used to measure the hardness of a material by determining its Brinell Hardness Number (BHN). This test provides insights into a material's resistance to deformation under an applied load, which is critical for assessing its suitability for various applications.",
              "The apparatus works by pressing a hard steel or tungsten carbide ball of a specific diameter onto the surface of the test material under a controlled load for a fixed duration. Once the load is removed, the diameter of the indentation left on the material is measured using a microscope or optical device. The BHN is calculated using the applied load, the diameter of the ball, and the size of the indentation. The Brinell Hardness Tester is widely used in quality control and material testing across industries such as metallurgy, automotive, and manufacturing to evaluate materials like metals, alloys, and composites."
            ]
            },
          {
            "name": "Rockwell Hardness Tester",
            "image": "/New BTP/Material Characterization Laboratory/Rockwell Hardness Tester .jpg",
            "description": [
              "The Rockwell Hardness Tester is an essential tool for determining the Rockwell hardness of a material, which measures its resistance to deformation under an applied load. This method is widely used due to its speed, simplicity, and ability to test a wide range of materials.",
              "The equipment operates by pressing a steel or carbide ball or a conical diamond (depending on the test scale) into the material's surface under a specific preliminary load. Afterward, a major load is applied, and the depth of the resulting indentation is measured. The hardness value is displayed directly on the machine's dial or digital display, eliminating the need for manual calculations. The Rockwell Hardness Tester is extensively used in industries such as metallurgy, manufacturing, and quality control for evaluating metals, plastics, and ceramics. It helps in material selection, ensuring reliability and performance in applications ranging from construction to automotive engineering."
            ]
            },
          {
            "name": "Digital Impact Testing Machine.jpg",
            "image": "/New BTP/Material Characterization Laboratory/Digital Impact Testing Machine.jpg",
            "description": [
              "The Digital Impact Testing Machine for Charpy and Izod Tests is a specialized device designed to determine the toughness property of materials. Toughness indicates a material's ability to absorb energy and withstand sudden impacts without fracturing, which is critical for assessing its performance under dynamic loads.",
              "The equipment consists of a pendulum hammer, a specimen holder, and a digital display system. In the Charpy test, the specimen is supported as a beam, while in the Izod test, it is clamped vertically. The pendulum is released to strike the notched specimen, and the machine measures the energy absorbed during the fracture. This energy value is displayed digitally, ensuring precise and quick readings. The Digital Impact Testing Machine is widely used in material characterization laboratories for evaluating metals, plastics, and composites. Its applications include quality control, research, and development, helping industries ensure materials meet safety and performance standards in engineering and manufacturing."
            ]
            },
          {
            "name": "Pin-On-Disc Wear Testing Machine",
            "image": "/New BTP/Material Characterization Laboratory/Pin On Disc Wear Testing Machine .jpg",
            "description": [
              "The Pin on Disc Wear Testing Machine is designed to determine the wear rate between two metal surfaces under controlled conditions, simulating metal-to-metal interaction. It is a critical tool in evaluating the tribological properties of materials, such as wear resistance and frictional behavior.",
              "This equipment consists of a rotating disc and a stationary pin, which is pressed against the disc under a specific load. The disc is driven by a motor at a controlled speed, and the wear is measured by monitoring the weight loss of the pin or disc before and after testing. The frictional force can also be recorded during the test. The machine is commonly used in material characterization to study wear mechanisms in metals, coatings, and composites. It provides valuable data for industries like automotive, aerospace, and manufacturing, enabling the development of durable materials and improving component performance in real-world applications."
            ]
            },
          {
            "name": "ERICHSEN Cupping Tester Model EC",
            "image": "/New BTP/Material Characterization Laboratory/ERICHSEN Cupping Tester .JPG",
            "description": [
              "The ERICHSEN Cupping Tester Model EC is an essential tool used to evaluate the formability of sheet metal materials. It determines the material's ability to undergo plastic deformation without failure when subjected to a forming operation.",
              "This equipment works by clamping a metal sheet securely and then pressing a spherical or semi-spherical punch into the sheet until visible cracks appear. The depth of the punch penetration at the point of cracking is recorded as the Erichsen Cupping Index, which indicates the material's formability.",
              "Widely used in industries like automotive, aerospace, and manufacturing, this tester helps assess the quality and suitability of materials for forming processes such as stamping and drawing. By providing insights into material ductility and deformation limits, it ensures optimal material selection and minimizes defects in finished components, thus improving product reliability and manufacturing efficiency."
            ]
            },
          {
            "name": "Torsional Testing Machine",
            "image": "/New BTP/Material Characterization Laboratory/Torsional Testing M_C.jpg",
            "description": [
              "The Torsional Testing Machine is used to determine the torsional rigidity, strength, and behavior of materials under twisting loads. This equipment is essential for evaluating materials that are subjected to torque during their application, such as shafts, rods, and other structural components.",
              "The machine operates by securely clamping the specimen between two jaws. One end is fixed, while the other is rotated to apply a twisting moment or torque. The equipment measures the angle of twist and the corresponding torque applied until the material fails or reaches its elastic limit. These measurements are used to calculate the material's torsional rigidity and shear modulus.",
              "This testing is crucial in industries like automotive, aerospace, and manufacturing, where components experience torsional stresses. The results guide material selection and design processes to ensure safety, reliability, and optimal performance in torsion-loaded applications."
            ]
            },
          {
            "name": "Digital Fatigue Testing Machine",
            "image": "/New BTP/Material Characterization Laboratory/Digital Fatigue Testing Machine.jpg",
            "description": [
              "The Digital Fatigue Testing Machine is used to determine the fatigue characteristics of materials, such as the number of cycles a material can withstand under repeated stress before failure. It is essential for evaluating the durability and life expectancy of components subjected to cyclic loading.",
              "The machine applies a variable cyclic load (tension, compression, or bending) to a specimen. The stress level, frequency, and type of load can be set digitally. Sensors and a digital interface record the number of cycles endured until the material develops fatigue cracks or fails. This data helps plot an S-N curve (stress vs. number of cycles) to assess the fatigue limit of the material.",
              "This equipment is widely used in industries like automotive, aerospace, and civil engineering to ensure materials meet safety and performance standards. The insights guide the design of components to resist failure under cyclic loading conditions."
            ]
            }
        ]
      },
      {
        "name": "Thermodynamics Lab",
        "equipments": [
          {
            "name": "Red Wood Oil Viscometer with Digital Temperature Indicator",
            "image": "/New BTP/Thermodynamics Lab/Red Wood Oil Viscometer with Digital Temperature Indicator.jpg",
            "description": [
              "The Red Wood Oil Viscometer with a digital temperature indicator is used to measure the viscosity of oils and other liquids, especially in the petroleum industry. It is primarily used to compare the viscosities of different liquids at specific temperatures, which is critical for determining their flow characteristics and suitability for various applications.",
              "To use the viscometer, the liquid sample is placed in a standard test container, and the device measures the time it takes for the liquid to flow through a specified orifice under controlled temperature conditions. The digital temperature indicator ensures that the viscosity is measured at the correct temperature, as viscosity is highly temperature-dependent.",
              "The Red Wood Oil Viscometer is used in industries where oil properties need to be consistent, such as in lubricants, fuels, and other petroleum products. It provides valuable data for quality control, research, and product development by helping determine how different oils or liquids will perform under specific conditions."
            ]
            },
          {
            "name": "Vapor Absorption Refrigeration Test Rig",
            "image": "/New BTP/Thermodynamics Lab/Vapor Absorption Refrigeration Test Rig.jpg",
            "description": [
              "The Vapor Absorption Refrigeration Test Rig is designed to demonstrate and analyze the performance of a vapor absorption refrigeration system. It is used primarily to calculate the Coefficient of Performance (C.O.P.) of the system, which is a measure of its efficiency.",
              "To use the test rig, the system is set up to circulate the refrigerant through various components, including the generator, absorber, condenser, and evaporator. The rig allows for the monitoring and measurement of parameters such as temperatures, pressures, and flow rates at different stages of the cycle. These measurements are used to calculate the C.O.P., which is the ratio of the cooling effect produced to the energy input required.",
              "This rig is essential in understanding the working principle of absorption refrigeration systems, commonly used in applications where electrical power supply is limited, such as in remote areas or for waste heat utilization. It is also useful for students and engineers in learning about energy efficiency in refrigeration systems."
            ]
            },
          {
            "name": "Pycnometer",
            "image": "/New BTP/Thermodynamics Lab/Pycnometer.jfif",
            "description": [
              "A pycnometer is a precise instrument used to measure the density of solids and liquids. It works based on the principle of measuring the volume of a sample by displacement of a known volume of liquid or gas.",
              "To use a pycnometer, the sample is placed in the pycnometer flask, which is then filled with a liquid (usually water or another fluid with a known density). For solids, the pycnometer is first weighed empty, then filled with the solid sample, and the weight is measured again. For liquids, the pycnometer is filled with the liquid, and the weight difference is used to calculate the density based on the displacement.",
              "The density is calculated using the formula: Density = Mass / Volume.",
              "This device is used in laboratories for applications in materials science, chemistry, and engineering, where precise density measurements are necessary for determining material properties, quality control, and product development."
            ]
            },
          {
            "name": "Transys Software",
            "image": "/New BTP/Thermodynamics Lab/Transys Software.jfif",
            "description": [
              "Transys Software is used for conducting transient condition modeling and simulation studies, primarily in the fields of energy systems, building performance, and environmental engineering. It allows users to model and simulate the behavior of complex systems over time, considering transient (time-dependent) conditions.",
              "To use Transys, a user typically inputs data about the system components (e.g., heating, cooling, ventilation, energy sources, and storage systems) into the software. The software then simulates the performance of these systems under different operating conditions, taking into account factors such as thermal dynamics, energy consumption, and environmental influences. The results can be used to analyze the system's efficiency, identify potential areas for improvement, and make informed decisions about system design and optimization.",
              "Transys is widely used for studying renewable energy systems, HVAC systems, building energy management, and other applications that involve time-dependent behaviors and dynamic system interactions."
            ]
            },
          {
            "name": "Solar Power Meter",
            "image": "/New BTP/Thermodynamics Lab/Solar Power Meter.jfif",
            "description": [
              "A Solar Power Meter is a device used to measure the intensity of solar radiation, typically expressed in watts per square meter (W/m²). It is crucial for assessing the performance of solar energy systems and determining the amount of sunlight received at a given location.",
              "To use the Solar Power Meter, it is positioned in direct sunlight with its sensor facing the sun. The sensor detects the amount of solar radiation hitting its surface and converts this energy into an electrical signal, which is then displayed on the meter's readout. This data helps evaluate solar panel efficiency, estimate energy generation potential, and assess environmental conditions for solar energy applications.",
              "Solar Power Meters are widely used in solar energy research, installation, and maintenance, as well as for environmental monitoring and studies related to climate and weather patterns. They play a vital role in ensuring optimal performance and reliability of solar power systems."
            ]
            },
          {
            "name": "Test Rig to Study Psychometric Properties",
            "image": "/New BTP/Thermodynamics Lab/Test Rig to Study Psychometric Properties.jpg",
            "description": [
              "A Test Rig to Study Psychometric Properties is a laboratory setup designed to measure and analyze the thermodynamic properties of air, such as temperature, humidity, pressure, and enthalpy. This rig is used to understand the psychrometric process, which involves the changes in air properties as it is heated, cooled, humidified, or dehumidified.",
              "To use the test rig, air is passed through different conditions like heating, cooling, or humidification. The equipment includes various sensors to measure parameters like dry bulb temperature, wet bulb temperature, relative humidity, and air pressure. These readings are used to plot psychrometric charts, which help visualize the air’s properties and the relationship between them.",
              "This rig is commonly used in HVAC (heating, ventilation, and air conditioning) studies, environmental engineering, and meteorology to evaluate the performance of air-conditioning systems, design energy-efficient buildings, and analyze air quality in various conditions."
            ]
            }
        ]
      },
      {
        "name": "Internal Combustion Engine Laboratory",
        "equipments": [
          {
            "name": "VCR Diesel Engine Test Rig",
            "image": "/New BTP/Internal Combustion Engine Laboratory/VCR Diesel Engine Test Rig_.jpg",
            "description": [
              "The VCR Diesel Engine Test Rig is designed to study the performance characteristics of a single-cylinder, four-stroke diesel engine, equipped with a Variable Compression Ratio (VCR) mechanism and an open Engine Control Unit (ECU). This setup allows for the analysis of engine behavior under different compression ratios and control strategies, making it ideal for educational and research purposes.",
              "To use the test rig, the engine is powered by a fuel supply, and the compression ratio is adjusted by varying the position of the piston. Sensors and instruments measure key parameters such as fuel consumption, power output, exhaust emissions, temperature, and engine speed. The ECU can be programmed to control various engine functions, such as fuel injection timing and air-fuel ratio, for performance optimization.",
              "This test rig provides valuable insights into how changes in compression ratio and ECU control influence engine efficiency, emissions, and power output, making it essential for internal combustion engine studies."
            ]
            },
          {
            "name": "Double Stage Air Compressor Test Rig",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Double Stage Air Compressor Test Rig.jpg",
            "description": [
              "The Double Stage Air Compressor Test Rig is used to study the performance characteristics of a reciprocating air compressor with two compression stages. It allows for the detailed analysis of the compressor's behavior, efficiency, and output under various operating conditions.",
              "To use the rig, air is drawn into the compressor, compressed in two stages—first at a low pressure and then at a higher pressure—before being discharged. The rig is equipped with instruments to measure parameters such as inlet and discharge pressures, temperature at various stages, air flow rate, and power consumption. The performance data helps in analyzing factors such as volumetric efficiency, mechanical efficiency, and overall compressor performance.",
              "This test rig is valuable for understanding the thermodynamic processes involved in multi-stage compression, as well as for assessing the compressor's efficiency, heat generation, and power consumption. It is commonly used in academic settings, mechanical engineering research, and for compressor design optimization."
            ]
            },
          {
            "name": "Mini Oil Expeller",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Mini oil-expeller.webp",
            "description": [
              "The Mini Oil Expeller is a compact machine used for extracting oil from various seeds, nuts, and algae. It operates on the principle of mechanical pressing, using a screw conveyor (also known as an auger) to press the raw material to extract oil.",
              "To use the Mini Oil Expeller, the seeds or nuts are fed into the hopper. As the material moves through the expeller, the screw presses it against a perforated cage, applying high pressure to separate the oil from the solid components (cake). The extracted oil is collected in a container, while the remaining cake is discharged from the machine. The oil expeller is typically equipped with a heating element to warm the material, facilitating better oil extraction and improving efficiency.",
              "This equipment is ideal for small-scale oil production, such as for producing edible oils from sunflower seeds, peanuts, or mustard seeds. It is commonly used in small industries, research labs, and for educational purposes."
            ]
            },
          {
            "name": "Cut Section Single Cylinder 4 Stroke Diesel Engine",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Cut Section Single Cylinder 4 Stroke Diesel Engine.jpg",
            "description": [
              "The Cut Section Single Cylinder 4-Stroke Diesel Engine is a specially designed model used for educational and demonstration purposes. It features a transparent cut section of a single-cylinder, four-stroke diesel engine, allowing for a clear view of the internal components in motion. This setup is primarily used to study the operation and working of the engine, particularly the valve timing, and other critical aspects like fuel injection, combustion, and exhaust processes.",
              "To use the engine, students or researchers observe the engine's internal operation as the engine runs, with the cut section revealing the intake, compression, power, and exhaust strokes in action. The valve timing can be determined by analyzing the movement of the intake and exhaust valves during each stroke. This model is ideal for understanding the relationship between valve timing and engine performance, helping students visualize the mechanical processes in a real diesel engine."
            ]
            },
          {
            "name": "Multi Cylinder 4 Stroke Petrol Engine",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Multi Cylinder 4 Stroke Petrol Engine.jpg",
            "description": [
              "The Multi Cylinder 4 Stroke Petrol Engine is used to study the performance characteristics of a multi-cylinder, four-stroke petrol engine. This engine is commonly employed in research and educational settings to understand the working principles, efficiency, and dynamics of modern internal combustion engines.",
              "To use the engine, fuel is supplied to the cylinders, and it operates in a four-stroke cycle: intake, compression, power, and exhaust. The engine is equipped with various sensors to measure key parameters such as fuel consumption, engine speed, power output, exhaust emissions, and temperature at different points. Performance characteristics, such as volumetric efficiency, thermal efficiency, and specific fuel consumption, can be analyzed under different load and speed conditions.",
              "This test rig is essential for teaching students about engine mechanics, thermodynamics, and combustion processes. It is also valuable for conducting experiments to optimize engine performance, improve fuel efficiency, and reduce emissions."
            ]
            },
          {
            "name": "Single Cylinder Diesel Engine",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Single Cylinder Diesel Engine.jpg",
            "description": [
              "The Single Cylinder Diesel Engine is used to study the performance characteristics of a single-cylinder, four-stroke manual diesel engine. This engine setup provides hands-on learning for understanding the operation, fuel efficiency, and emissions of a diesel engine.",
              "To use the engine, it is started manually, and the fuel is supplied to the single cylinder, which operates in a four-stroke cycle: intake, compression, power, and exhaust. Key performance parameters such as engine speed, torque, fuel consumption, and exhaust temperature are measured during the operation. The engine is typically equipped with instrumentation to measure exhaust emissions, helping in the analysis of combustion efficiency and environmental impact.",
              "This equipment is crucial for studying engine mechanics, analyzing fuel efficiency under various load conditions, and investigating the effects of different operating parameters on engine performance. It is commonly used in educational institutions for training and research in internal combustion engine technology."
            ]
            },
          {
            "name": "Automatic Bomb Calorimeter with Built-in Printer",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Automatic Bomb Calorimeter with Built-in Printer.jpg",
            "description": [
              "The Automatic Bomb Calorimeter with Built-In Printer is used to measure the standard enthalpy of combustion of substances, typically benzoic acid, and to determine the heat capacity of the bomb calorimeter. It is an essential tool for studying the energy content of fuels and other materials by determining the heat released during combustion.",
              "To use the calorimeter, a sample of the substance (e.g., benzoic acid) is placed in a sealed container known as a bomb, which is filled with oxygen. The bomb is then immersed in a known amount of water, and the sample is ignited electrically. The heat released from the combustion raises the temperature of the surrounding water. The temperature change is recorded, and with the known heat of combustion of the benzoic acid, the heat capacity of the bomb calorimeter can be determined.",
              "This device is widely used in laboratories for precise calorimetry experiments, fuel testing, and thermodynamic studies."
            ]
            },
          {
            "name": "Electronic Balance",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Electronic Balance.jfif",
            "description": [
              "The Electronic Balance, with a capacity of 220 grams, is used to measure the weight or mass of an item with high precision. It is equipped with a digital display that provides a quick and accurate reading of the mass of the object placed on its weighing pan.",
              "To use the electronic balance, the item to be weighed is placed carefully on the balance's platform. The balance automatically measures the force exerted by the item due to gravity and converts this into a mass reading, displayed on the digital screen. The balance is often equipped with features such as tare functions to zero out the weight of containers, making it ideal for weighing small objects or substances.",
              "This equipment is commonly used in laboratories, workshops, and educational settings where precise measurement of small items, chemicals, or components is necessary for experiments, quality control, or research. It offers quick, reliable, and accurate measurements."
            ]
            },
          {
            "name": "5 Gas Analyzer",
            "image": "/New BTP/Internal Combustion Engine Laboratory/5 Gas Analyzer.jfif",
            "description": [
              "The 5 Gas Analyzer is used to measure the concentration of various gases in exhaust emissions, including carbon monoxide (CO), carbon dioxide (CO2), oxygen (O2), nitrogen oxides (NOx), and hydrocarbons (HC). This equipment is essential for analyzing the environmental impact of combustion processes and ensuring compliance with emission standards.",
              "To use the analyzer, a sample of exhaust gas is drawn into the analyzer from the emission source, such as a vehicle or industrial engine. The instrument uses various sensing technologies, such as electrochemical cells or infrared sensors, to detect and quantify the gases present in the sample. The analyzer then provides real-time measurements of each gas, typically displayed digitally.",
              "This equipment is widely used in research, automotive testing, and environmental monitoring to assess engine performance, fuel efficiency, and emissions. It helps in optimizing combustion processes, improving air quality, and adhering to regulatory standards for emissions control."
            ]
            },
          {
            "name": "Smoke Meter",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Smoke-Meter.jpg",
            "description": [
              "The Smoke Meter is used to measure the soot content in the exhaust gases of diesel and Gasoline Direct Injection (GDI) engines. It helps determine the level of particulate matter (PM) or smoke emitted, which is crucial for assessing engine performance and compliance with environmental standards.",
              "To use the smoke meter, exhaust gases are drawn into the meter through a sampling probe connected to the engine's exhaust system. The instrument measures the opacity (density of the smoke) of the exhaust, which correlates with the soot or particulate matter concentration. The results are typically displayed as a smoke number or opacity percentage.",
              "This equipment is essential for conducting emission tests in automotive and industrial applications. It allows for evaluating the efficiency of combustion, identifying incomplete combustion issues, and ensuring adherence to environmental regulations related to air quality. It is commonly used in engine testing, maintenance, and regulatory inspections."
            ]
            },
          {
            "name": "Data Acquisition Switch Unit",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Data Acquisition Switch Unit.jfif",
            "description": [
              "The Data Acquisition Switch Unit is used to measure and monitor a variety of functions in experimental and testing setups, typically in laboratories or industrial environments. This unit can measure one of 11 different functions, such as temperature, pressure, voltage, current, humidity, force, or displacement, depending on the sensors and probes connected to it.",
              "To use the unit, the appropriate sensor or transducer is connected to the switch unit, which then converts the raw data into readable output. The data acquisition system allows the user to switch between different types of measurements, making it versatile for different applications. The unit typically interfaces with a computer or display system for data visualization and analysis.",
              "This equipment is widely used in research, testing, and quality control processes where continuous monitoring and accurate measurement of various physical parameters are required. It is key in ensuring precise data collection for analysis, testing, and decision-making."
            ]
            },
          {
            "name": "Diesel Injector Tester",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Diesel Injector Tester.jfif",
            "description": [
              "The Diesel Injector Tester is used to test and adjust the injector opening pressure of diesel fuel injectors. This ensures that the injectors function efficiently and deliver fuel at the correct pressure for optimal engine performance and fuel combustion.",
              "To use the tester, the diesel injector is mounted securely on the device. The tester is then powered on, and pressure is gradually applied to the injector. The unit measures the pressure at which the injector opens, ensuring it meets the specified standards for the engine type. If necessary, the pressure can be adjusted by modifying the injector components, ensuring proper spray pattern and fuel atomization for efficient combustion.",
              "The Diesel Injector Tester is commonly used in automotive workshops, engine maintenance, and testing facilities. It plays a critical role in maintaining engine performance, reducing emissions, and improving fuel efficiency by ensuring that diesel injectors are functioning within their required specifications."
            ]
            },
          {
            "name": "Portable Hand Held Biogas Analyzer",
            "image": "/New BTP/Internal Combustion Engine Laboratory/Portable Hand Held Biogas Analyzer.jpg",
            "description": [
              "The Portable Hand-Held Biogas Analyzer is used to measure the concentration of various gases in biogas, including methane (CH4), carbon dioxide (CO2), oxygen (O2), hydrogen sulfide (H2S), and optional gases like hydrogen (H2) and carbon monoxide (CO). This tool is essential for monitoring the composition of biogas in real-time, ensuring its quality for use in energy production or other applications.",
              "To use the analyzer, the device is equipped with a probe that is inserted into the gas sample or biogas stream. The analyzer then detects and measures the gas concentrations using sensors specific to each gas. The results are displayed on the screen, and data can be recorded for analysis.",
              "This portable device is commonly used in biogas plants, environmental monitoring, and research settings. It helps ensure the safe and efficient use of biogas by monitoring gas quality and composition, which is critical for combustion efficiency and regulatory compliance."
            ]
            }
        ]
      },
      {
        "name": "Fluid Mechanics and Machines Laboratory",
        "equipments": [
          {
            "name": "Metacentric Height Apparatus",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/MetacentricHeightApparatus.jpg",
            "description": [
              "The Metacentric Height Apparatus is used to determine the metacentric height of a floating body, a key parameter in assessing its stability in fluid mechanics. The metacentric height is the distance between the center of gravity and the metacenter, which indicates the body's ability to return to equilibrium when tilted.",
              "To use the apparatus, the floating body (usually a rectangular or cylindrical model) is placed in a water tank. Weights are added or shifted on the body to create an angular tilt. The tilt angle is measured, and the distance of the weight shift is recorded. Using these values and the apparatus's dimensions, the metacentric height is calculated.",
              "This apparatus is commonly employed in fluid mechanics laboratories for educational and research purposes. It helps students understand principles of buoyancy and stability, and it is essential for applications like designing ships and other floating structures to ensure their safety and balance in water."
            ]
            },
          {
            "name": "Bernoulli’s Theorem Apparatus",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/BernoulliTheoremApparatus.jpg",
            "description": [
              "The Bernoulli’s Theorem Apparatus is used to validate Bernoulli’s principle, which states that the total energy in a steady, incompressible fluid flow remains constant along a streamline. This principle combines pressure energy, kinetic energy, and potential energy to explain fluid behavior.",
              "The apparatus typically consists of a transparent venturi tube with varying cross-sectional areas, a water flow system, and manometers or pressure sensors to measure pressure at different points. To use it, water is allowed to flow through the tube while maintaining a steady rate. The pressure readings at various points are recorded, along with the corresponding flow velocities and cross-sectional areas.",
              "By comparing the pressure and velocity data, students can verify that the sum of pressure head, velocity head, and elevation head remains constant. This equipment is extensively used in fluid mechanics laboratories for teaching and research, providing practical insights into the fundamental principles of fluid dynamics."
            ]
            },
          {
            "name": "Flow Measuring Apparatus",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/FlowMeasuringApparatus.jpg",
            "description": [
              "The Flow Measuring Apparatus is used to calibrate and study different types of flow meters, which are essential for measuring the flow rate of liquids or gases in pipes. The apparatus typically includes a test section with various flow meters, such as orifice meters, venturi meters, and rotameters, and is designed to assess their accuracy and performance.",
              "To use the apparatus, a known flow rate is established using a pump or other flow control devices, and the flow rate is measured with the device under test. The readings from different flow meters are compared to the actual flow rate, allowing for calibration or performance analysis.",
              "This apparatus is widely used in fluid mechanics laboratories for educational and research purposes. It helps students understand the working principles of flow meters, their applications, and how they can be calibrated or selected for specific industrial needs, ensuring accurate flow measurement in various systems."
            ]
            },
          {
            "name": "Pipe Friction Loss Apparatus",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/PipefrictionlossApparatus.jpg",
            "description": [
              "The Pipe Friction Loss Apparatus is used to determine the fluid friction factor in pipes, which is crucial for understanding the energy losses due to friction when fluid flows through a pipe. The friction factor influences pressure drops and is essential for designing efficient fluid transport systems.",
              "To use the apparatus, water or another fluid is pumped through a test pipe, and various parameters such as flow rate, pipe diameter, and fluid velocity are controlled. Pressure taps along the length of the pipe are used to measure pressure at different points, and the difference in pressure (head loss) is recorded. The fluid’s velocity is also measured to calculate the Reynolds number, which helps determine the flow regime (laminar or turbulent).",
              "This apparatus helps students and researchers study the relationship between flow rate, pipe characteristics, and friction loss, offering insights into hydraulic performance and aiding in the design of piping systems in engineering applications."
            ]
            },
          {
            "name": "Orifice Meter Apparatus",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/OrificeMeterApparatus.jpg",
            "description": [
              "The Orifice Meter Apparatus is used to determine the hydraulic coefficients of an orifice meter, a device employed to measure the flow rate of fluids through pipes. The apparatus consists of a pipe section with an orifice plate, where the fluid flow passes through a precisely measured opening, causing a pressure drop.",
              "To use the apparatus, fluid is allowed to flow through the pipe, and the flow rate is varied. Pressure taps before and after the orifice plate measure the pressure difference. The flow rate is calculated based on the pressure drop and the geometry of the orifice. The hydraulic coefficients, such as the discharge coefficient, are determined by comparing the theoretical and experimental data.",
              "This apparatus is widely used in fluid mechanics laboratories to validate the application of orifice meters, which are commonly used in industries for flow measurement in pipes. It helps in understanding the principles of fluid dynamics and flow measurement techniques."
            ]
            },
          {
            "name": "Centrifugal Pump Test Rig",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/CentrifugalPumpTestRig.jpg",
            "description": [
              "The Orifice Meter Apparatus is used to determine the hydraulic coefficients of an orifice meter, a device employed to measure the flow rate of fluids through pipes. The apparatus consists of a pipe section with an orifice plate, where the fluid flow passes through a precisely measured opening, causing a pressure drop.",
              "To use the apparatus, fluid is allowed to flow through the pipe, and the flow rate is varied. Pressure taps before and after the orifice plate measure the pressure difference. The flow rate is calculated based on the pressure drop and the geometry of the orifice. The hydraulic coefficients, such as the discharge coefficient, are determined by comparing the theoretical and experimental data.",
              "This apparatus is widely used in fluid mechanics laboratories to validate the application of orifice meters, which are commonly used in industries for flow measurement in pipes. It helps in understanding the principles of fluid dynamics and flow measurement techniques."
            ]
            },
          {
            "name": "Francis Turbine Test Rig",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/FrancisTurbineTestRig.jpg",
            "description":[
              "The Francis Turbine Test Rig is used to study the performance characteristics of a Francis turbine, a type of water turbine commonly used in hydroelectric power plants. This apparatus allows for the measurement and analysis of key parameters such as flow rate, head, power output, and efficiency under varying operating conditions.",
              "To use the test rig, water is supplied to the turbine through a controlled system. The turbine's output shaft is connected to a dynamometer to measure power output. Pressure gauges are used to measure the pressure at different points, and flow rate is controlled and measured using flow meters. By adjusting variables such as flow rate and head, the rig enables the determination of the turbine's performance curve, which relates flow rate to power output and efficiency.",
              "This equipment is essential in educational and research laboratories for understanding the operational principles of turbines, and it provides insights into turbine design, optimization, and performance evaluation in real-world applications."
            ]
            },
          {
            "name": "Kaplan Turbine Test Rig",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/KaplanTurbineTestRig.jpg",
            "description": [
              "The Kaplan Turbine Test Rig is used to study and analyze the performance of a Kaplan turbine, a type of axial-flow reaction turbine commonly used in low-head hydroelectric power generation. This test rig helps in understanding the relationship between flow rate, head, power output, and efficiency under varying operational conditions.",
              "To use the rig, water is directed to the Kaplan turbine through a controlled flow system. The turbine's blades are adjustable, allowing for the optimization of performance at different flow rates. The rig is equipped with pressure gauges, flow meters, and a dynamometer to measure key parameters such as head, flow rate, and power output. By adjusting the flow rate and load conditions, the turbine's performance curve can be plotted, illustrating its efficiency and power generation capability.",
              "This test rig is essential for educational purposes, helping students and researchers gain insights into turbine behavior, design, and optimization in real-world hydroelectric applications."
            ]
            },
          {
            "name": "Pelton Wheel Turbine Test Rig",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/PeltonWheelTurbine.jpg",
            "description": [
              "The Pelton Wheel Turbine Test Rig is used to study the performance characteristics of a Pelton wheel turbine, a type of impulse turbine commonly used for high-head hydroelectric power generation. This apparatus helps in understanding the principles of impulse turbines, including the relationship between flow rate, pressure, and power output.",
              "To use the test rig, water is supplied under controlled conditions to the turbine through a nozzle, which converts the potential energy of water into kinetic energy. The high-speed water jet strikes the Pelton wheel's buckets, causing the wheel to rotate. A dynamometer is used to measure the power output, and flow meters measure the water flow rate. Pressure gauges at different points help assess the pressure drop.",
              "By adjusting parameters like flow rate and head, the rig enables the creation of performance curves for the turbine, allowing students and researchers to analyze its efficiency, power generation capabilities, and operational behavior under different conditions."
            ]
            },
          {
            "name": "Anemometer",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/AnemometerApparatus.jpg",
            "description": [
              "An anemometer is an instrument used to measure wind speed and airflow velocity. It is commonly used in meteorology, environmental studies, and HVAC systems to assess air movement in various applications.",
              "The most common type of anemometer consists of rotating cups or blades mounted on a shaft. As wind or airflow strikes the cups, they rotate, and the speed of rotation is directly proportional to the wind velocity. Some advanced versions may use a vane or digital sensors to measure airflow more accurately. The rotational speed is converted into wind speed, which can be displayed on a digital or analog readout.",
              "To use the anemometer, it is placed in the airflow path, either outdoors to measure wind speed or in controlled environments like air ducts or ventilation systems. It helps in determining airflow rates, monitoring weather conditions, and optimizing air distribution in buildings. It is an essential tool in studies of fluid dynamics and climate analysis."
            ]
            },
          {
            "name": "Micro Processor-Based Turbidity & Temperature Meter",
            "image": "/New BTP/Fluid Mechanics and Machines Laboratory/Micro Processor-Based Turbidity & Temperature Meter.jfif",
            "description": [
              "The Micro Processor-Based Turbidity & Temperature Meter is used for precise measurement of turbidity and temperature in liquids, particularly water. Turbidity is a key parameter in assessing water quality, as it indicates the presence of suspended particles, pollutants, or impurities. This meter is commonly used in environmental monitoring, water treatment, and laboratory analysis.",
              "The equipment consists of a microprocessor that processes signals from sensors detecting light scattering due to suspended particles in the water, providing a turbidity reading, typically in Nephelometric Turbidity Units (NTU). It also measures the water's temperature using a temperature sensor, allowing for temperature compensation in turbidity readings, as temperature can affect the scattering of light.",
              "To use the meter, a sample of the liquid is placed in a transparent container, and the meter is calibrated. The device then provides accurate real-time readings of both turbidity and temperature, helping ensure water quality meets required standards for various industrial, environmental, and research applications."
            ]
            }
        ]
      },
      {
        "name": "Computer Integrated Manufacturing (CIM) Laboratory",
        "equipments": [
          {
            "name": "3D Printer (Dual Extruder)",
            "image": "/New BTP/Computer integrated Manufacturing/3D Printer (Dual Extruder).jpg",
            "description": [
              "A 3D Printer with Dual Extruder is a cutting-edge tool for creating physical solid models through additive manufacturing, commonly used for rapid prototyping. The dual extruder setup allows the printer to work with two materials or colors simultaneously, enhancing versatility and precision in model fabrication.",
              "To use the 3D printer, a digital 3D model is created using CAD software and then sliced into printable layers using slicing software. The printer lays down successive layers of material, typically plastic filaments like PLA or ABS, one over the other to construct the model. With dual extruders, users can combine different materials—for instance, rigid and flexible—or integrate dissolvable supports for intricate designs.",
              "This 3D printer is essential in education, product development, and research. It helps students and professionals visualize concepts, test prototypes, and explore complex geometries, making it a vital tool for innovation in design, engineering, and manufacturing."
            ]
            },
          {
            "name": "3D Printer (Single Extruder)",
            "image": "/New BTP/Computer integrated Manufacturing/3D Printer (Single Extruder).jpg",
            "description": [
              "A 3D Printer with a Single Extruder is a device used to create physical solid models through additive manufacturing, primarily for rapid prototyping and design validation. It operates by depositing material layer by layer, building a three-dimensional object directly from a digital model.",
              "To use the printer, a 3D design is created using CAD software and processed through slicing software to generate a layer-by-layer instruction file. The printer’s single extruder then melts and extrudes a filament, typically made of materials like PLA or ABS, depositing it precisely on the print bed. Each successive layer fuses to the previous one, gradually forming the complete model.",
              "This printer is widely utilized in educational, industrial, and research settings to bring digital concepts to life. It is particularly useful for prototyping, allowing designers and engineers to test and refine their ideas cost-effectively and efficiently, fostering innovation and creativity in product development."
            ]
            },
          {
            "name": "Vertical Machining Center (VMC)",
            "image": "/New BTP/Computer integrated Manufacturing/Vertical Machining Center .jpg",
            "description": [
              "A Vertical Machining Center (VMC) is a high-precision, computer numerical control (CNC) machine used for milling and various material removal operations. The vertical orientation of the spindle allows for efficient machining of a wide range of materials, including metals, plastics, and composites.",
              "To use the VMC, a CAD model of the desired part is created and converted into a CNC program using CAM software. This program is loaded into the machine’s controller, which automates the cutting process. The workpiece is secured on the machine table, and the spindle, equipped with cutting tools, performs operations such as drilling, milling, tapping, and contouring based on the programmed instructions.",
              "VMCs are widely used in manufacturing and educational environments to produce complex parts with high accuracy. They enhance productivity and consistency, making them essential for industries like aerospace, automotive, and tool-making, as well as for teaching advanced machining techniques."
            ]
            },
          {
            "name": "Electrical Discharge Machine (EDM)",
            "image": "/New BTP/Computer integrated Manufacturing/Electrical discharge machine.jpg",
            "description": [
              "An Electrical Discharge Machine (EDM) is a specialized manufacturing tool used for precision machining of hard materials and complex shapes that are difficult to machine using traditional methods. EDM operates by eroding material from a workpiece using electrical discharges (sparks) between an electrode and the workpiece, both submerged in a dielectric fluid.",
              "To use an EDM, a conductive workpiece and an electrode are set up in close proximity. When voltage is applied, controlled electrical discharges occur, creating localized heat that vaporizes and removes material from the workpiece. The dielectric fluid cools the material and flushes away debris, ensuring precise and clean machining.",
              "EDM is extensively used in industries such as aerospace, automotive, and tool and die making. It is ideal for creating intricate details, fine holes, and sharp corners in hard materials like titanium, carbide, and hardened steel, achieving high accuracy and smooth surface finishes."
            ]
            },
          {
            "name": "Micro Fog Oil Mist Lubrication System",
            "image": "/New BTP/Computer integrated Manufacturing/Micro fog oil mist lubrication system.jpg",
            "description": [
              "The Micro Fog Oil Mist Lubrication System is a high-precision lubrication setup designed to deliver a minimal quantity of high-quality lubricant directly to the cutting tool and workpiece interface. This system ensures efficient lubrication while reducing waste, making it a sustainable and cost-effective solution in machining processes.",
              "To use the system, the lubricant is atomized into a fine mist using compressed air and directed precisely to the machining area. The micro-level lubrication reduces friction, minimizes heat generation, and improves the lifespan of cutting tools. Additionally, it enhances the surface finish of the workpiece and maintains dimensional accuracy by preventing thermal deformation.",
              "This system is widely employed in CNC machining, milling, and drilling operations where precision and efficiency are critical. It reduces environmental impact by minimizing lubricant consumption and waste, making it an ideal choice for modern manufacturing facilities focusing on sustainability and operational excellence."
            ]
            }
        ]
      },
      {
        "name": "Robotics & Industrial Automation Laboratory",
        "equipments": [
          {
            "name": "OMIBO - Omni Wheel Operated Robot",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/OMIBO-Omni Wheel operated Robot.jpg",
            "description": [
              "The OMIBO (Omni Wheel Operated Robot) is a robot designed to demonstrate and teach the programming and design of omni-directional movement systems. Equipped with omni-wheels, the robot can move in any direction without changing its orientation, providing a highly versatile platform for robotics learning and experimentation.",
              
              "To use the OMIBO robot, the user programs the robot's movement using a controller or computer interface. The omni-wheels, which allow movement along both the X and Y axes simultaneously, enable the robot to travel forward, backward, sideways, or rotate while maintaining a constant heading. This makes the robot ideal for applications that require precise and flexible movement in confined spaces or complex environments.",
              
              "OMIBO is primarily used in robotics education and research to teach students about advanced movement systems, kinematics, and robot programming. It also provides a hands-on experience in controlling multi-degree-of-freedom robots, which are used in automated material handling and advanced robotics applications."
            ]
            },
          {
            "name": "Air Compressor Large",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/Air Compressor Large.jpg",
            "description": [
              "A large air compressor is a machine designed to provide a consistent supply of compressed air for various pneumatic equipment and tools. It works by drawing in ambient air, compressing it to a higher pressure, and storing it in a tank for later use. This compressed air can then be used to power pneumatic systems, control valves, and other industrial applications that require pressurized air.",
              
              "To use a large air compressor, the system is connected to a network of pneumatic tools or machines. The compressor's pressure settings are adjusted based on the requirements of the equipment being powered. When the compressor is running, it maintains a steady supply of air to the connected tools or systems.",
              
              "Large air compressors are commonly used in industries such as manufacturing, construction, and automation, where they serve applications like powering pneumatic drills, conveyors, and robotics, as well as controlling machinery in automated assembly lines."
            ]
          },
          {
            "name": "MARSian - Mars Rover Prototype",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/MARSian - Mars Rover Prototype.jpg",
            "description": [
              "MARSian, a Mars rover prototype, is a robotic platform designed to teach the programming and design of robots equipped with gripping mechanisms. Modeled after real-life Mars rovers, MARSian is used in educational settings to demonstrate how robots can navigate terrain and perform tasks, such as gripping and manipulating objects, in remote or harsh environments.",
              
              "The robot is equipped with wheels or tracks for mobility and a gripping mechanism (such as a claw or gripper) to pick up and move objects. Students can program MARSian to navigate obstacles, perform specific tasks like object retrieval, or interact with its environment in a controlled manner.",
              
              "MARSian is primarily used in robotics and engineering courses, where it provides hands-on learning in robot design, kinematics, and programming. It helps students understand the complexities of autonomous robots, grasp the principles of sensor integration, and develop skills in programming robotic movements and actuations for real-world applications like space exploration or industrial automation."
            ]
            },
          {
            "name": "JCBian – Pneumatic Back Hoe Loader",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/JCBian - Pneumatic Back Hoe Loader.jpg",
            "description":[
              "JCBian – Pneumatic Back Hoe Loader is a robotic model designed to simulate the functions of a real-life JCB backhoe loader, specifically focusing on the use of pneumatic systems for movement and operation. This equipment is used to teach students about the design, programming, and functionality of hydraulic and pneumatic systems in construction machinery.",
              
              "The JCBian model consists of pneumatic cylinders and actuators that control the movement of the boom, arm, and bucket, mimicking the operations of an actual backhoe loader. The system uses compressed air to power the pneumatic actuators, which can lift, lower, and move the bucket or arm, demonstrating the basic principles of fluid power and mechanical design.",
              
              "To use JCBian, students program and control the movement of the loader using a controller or interface, learning to integrate sensors, actuators, and pneumatics into a functional robotic system. It serves as an educational tool for understanding the complexities of heavy machinery and the principles behind their automation in construction."
            ]
            },
          {
            "name": "Flexo - The Robot Hand",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/Flexo - The Robot Hand.jpg",
            "description": [
              "Flexo – The Robot Hand is a robotic model designed to teach the programming and design of a wireless hand mechanism robot, utilizing Internet of Things (IoT) devices for control. This robot hand mimics the dexterity and movements of a human hand, using a combination of motors, sensors, and actuators to perform various gripping and manipulation tasks.",
              
              "To use Flexo, students design and program the hand to perform specific actions, such as grasping, holding, and releasing objects. The robot hand is typically controlled wirelessly through IoT devices, allowing remote operation via smartphones, computers, or other wireless controllers. The system leverages sensors to provide feedback on position and force, enabling the hand to adjust its movements and grip strength in real time.",
              
              "Flexo is mainly used in educational settings to teach the integration of robotics, wireless communication, and IoT technologies. It provides hands-on experience with robotic control systems, programming, and the development of wireless automation for practical applications like remote handling or teleoperation."
            ]
            },
          {
            "name": "Mobilo - Mobile Operated Robot",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/Mobilo - Mobile Operated Robot.jpg",
            "description": [
              "Mobilo – Mobile Operated Robot is a robotic platform designed to teach the programming and design of mobile robots that are controlled via a mobile phone or tablet. It is equipped with motors, sensors, and a microcontroller to enable it to move in different directions and perform specific tasks, such as obstacle avoidance or object manipulation.",
              
              "To use Mobilo, students program the robot’s movements using a mobile app or Bluetooth interface. The robot can be operated remotely by sending commands from a smartphone or tablet, which communicates wirelessly with the robot via Bluetooth or Wi-Fi. The programming involves coding the robot's movement patterns, response to environmental inputs, and interaction with sensors.",
              
              "Mobilo is widely used in educational settings, where it helps students learn about robotics, mobile communication, and programming. It offers a practical understanding of autonomous navigation, sensor integration, and mobile control, all essential skills for designing and operating mobile robots in real-world applications."
            ]
            },  
          {
            "name": "SMC Training Kit",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/SMC training Kit.jpg",
            "description": [
              "The SMC Training Kit is an educational tool designed to teach the design and implementation of pneumatic and electro-pneumatic systems. It includes various components such as pneumatic cylinders, valves, sensors, and actuators, along with a control unit that can be used to create and simulate pneumatic circuits and automation systems.",
              
              "To use the SMC Training Kit, students design and construct pneumatic circuits by connecting the components according to the desired system layout. They can program and control the system using electro-pneumatic algorithms to automate processes like controlling pressure, flow, or actuator movements. The kit is equipped with various sensors and controllers to monitor and adjust the system's performance.",
              
              "The SMC Training Kit is widely used in vocational training and educational settings to teach students about fluid power, automation, and control systems. It provides hands-on experience in designing and troubleshooting pneumatic systems, which are crucial in manufacturing, robotics, and industrial automation applications."
            ]
            },
          {
            "name": "SMC Local Manufacturing",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/SMC-local-Manufacturing.jpg",
            "description": [
              "The SMC Training Kit is an educational tool designed to teach the design and implementation of pneumatic and electro-pneumatic systems. It includes various components such as pneumatic cylinders, valves, sensors, and actuators, along with a control unit that can be used to create and simulate pneumatic circuits and automation systems.",
              
              "To use the SMC Training Kit, students design and construct pneumatic circuits by connecting the components according to the desired system layout. They can program and control the system using electro-pneumatic algorithms to automate processes like controlling pressure, flow, or actuator movements. The kit is equipped with various sensors and controllers to monitor and adjust the system's performance.",
              
              "The SMC Training Kit is widely used in vocational training and educational settings to teach students about fluid power, automation, and control systems. It provides hands-on experience in designing and troubleshooting pneumatic systems, which are crucial in manufacturing, robotics, and industrial automation applications."
            ]
            },
          {
            "name": "Electro Hydraulic Trainer with LG PLC",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/Electro Hydraulic Trainer with LG PLC.jpg",
            "description": [
              "The Electro-Hydraulic Trainer with LG PLC is an educational setup designed to teach students the principles of electro-hydraulic systems and PLC (Programmable Logic Controller) programming. It combines hydraulic components with electrical control systems to simulate real-world automation processes, providing practical experience in both fluid power and automation.",
              
              "To use the Electro-Hydraulic Trainer, students first design and assemble hydraulic circuits, integrating components like pumps, cylinders, and valves. The system is then controlled using an LG PLC, which is programmed to automate the hydraulic functions. Students learn to write and test PLC programs that control hydraulic actuators, allowing them to control fluid flow, pressure, and actuator movements.",
              
              "This setup is commonly used in vocational and engineering courses to demonstrate the integration of hydraulics with electrical control systems. It helps students understand how automation is applied in industrial processes, and teaches them to program and troubleshoot PLC systems for electro-hydraulic applications in fields like manufacturing and robotics."
            ]
            },
          {
            "name": "AUTOSIM-200 for 8 Education License",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/AUTOSIM-200 for 8 education license.jfif",
            "description": [
              "AUTOSIM-200 for 8 Education License is a simulation software designed to teach the virtual logic of pneumatic and electro-pneumatic systems. This software allows students to design, simulate, and test pneumatic and electro-pneumatic circuits in a virtual environment, offering a cost-effective and safe way to learn fluid power systems without the need for physical hardware.",
              
              "To use AUTOSIM-200, students create virtual circuits by selecting components such as valves, cylinders, and sensors from a library, and then connect them according to the desired system layout. The software allows users to simulate the operation of these circuits, observing how the components interact in real time. It also supports programming of electro-pneumatic systems, enabling students to practice writing control algorithms and troubleshooting logic.",
              
              "AUTOSIM-200 is commonly used in educational settings to help students understand the principles of pneumatic and electro-pneumatic systems, while enhancing their skills in designing, programming, and troubleshooting automation systems."
            ]
            },
          {
            "name": "Basic Electro-Pneumatics Training Software",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/Basic Electro-Pneumatics Training Software.jfif",
            "description": [
              "The Basic Electro-Pneumatics Training Software is an educational tool designed to teach the fundamental concepts of electro-pneumatic systems. It allows students to learn and practice the design, simulation, and control of pneumatic circuits integrated with electrical control systems in a virtual environment.",
              
              "To use the software, students create and simulate electro-pneumatic circuits by selecting from a range of components, such as pneumatic cylinders, solenoid valves, sensors, and actuators. The software enables them to design control sequences and observe how the components interact under various conditions. Students can also program and troubleshoot the control logic to automate operations within the system.",
              
              "This software is commonly used in vocational training, technical colleges, and engineering courses to introduce students to the basics of fluid power and automation. It offers a hands-on approach to learning, allowing students to understand electro-pneumatic components and control principles without the need for physical hardware, making it a valuable tool for practical learning and skill development."
            ]
            },
          {
            "name": "Basic Pneumatics Training Software",
            "image": "/New BTP/Robotics & Industrial Automation Laboratory/Basic Pneumatics training software.jpg",
            "description": [
              "The Basic Pneumatics Training Software is an educational tool designed to teach the foundational principles and applications of pneumatic systems. It provides a virtual environment for students to learn about pneumatic components, circuit design, and system operations, making it a cost-effective and safe way to practice fluid power concepts.",
              
              "To use the software, students can select various pneumatic components such as air compressors, cylinders, valves, and actuators from a component library and assemble them into circuits. The software allows simulation of these circuits, enabling learners to observe airflow, pressure changes, and the behavior of system components in real-time. It also includes interactive tutorials and exercises to reinforce theoretical knowledge.",
              
              "This software is widely used in technical and engineering education to introduce students to the design and operation of pneumatic systems. It helps them understand how pneumatic circuits function, troubleshoot system issues, and prepare for practical applications in industrial automation and machinery."
            ]
            }
        ]
      },
      {
        "name": "Automobiles Lab",
        "equipments": [
          {
            "name": "Flex ECU Application Software",
            "image": "/New BTP/Automotive Engineering Laboratory/ECU Simulator.jpg",
            "description": [
              "The Flex ECU Application Software is used for engine control unit (ECU) programming, testing, and customization. Its primary purpose is to facilitate the calibration, tuning, and monitoring of vehicle ECUs, allowing technicians to adjust parameters related to fuel injection, ignition timing, air-fuel ratios, and other critical engine functions for enhanced performance or efficiency.",
              
              "This software connects to the ECU through a specialized interface, enabling users to access real-time data, perform diagnostics, and implement software upgrades. It is widely used in tuning applications where users seek to maximize the performance of the engine by fine-tuning the ECU parameters to achieve desired results, such as increased horsepower, fuel economy, or emissions reduction.",
              
              "Additionally, it supports reverse engineering and reprogramming of ECUs, making it essential for research, development, and customization in motorsports and vehicle modifications."
            ]
            },
          {
            "name": "Internal Combustion Engine Application",
            "image": "/New BTP/Automotive Engineering Laboratory/Internal Combustion Engine Application.jpg",
            "description": [
              "The Internal Combustion Engine (ICE) Application is designed to study and analyze the performance of an engine under various operating conditions. This setup includes an ICE connected to measuring instruments, sensors, and data acquisition systems that capture key parameters such as fuel consumption, torque, speed, emissions, and temperature.",
            
              "By running the engine at different loads, speeds, and throttle positions, researchers can observe its efficiency, fuel economy, power output, and emissions. This data is essential for understanding the impact of variables like air-fuel mixture, ignition timing, and compression ratio on engine performance.",
            
              "The setup is widely used in research and development for optimizing engine design, improving fuel efficiency, and meeting emission standards. It provides a hands-on learning experience for students and professionals, enabling them to visualize engine dynamics and apply theoretical concepts to practical testing, ultimately advancing automotive technology."
            ]
            },
          {
            "name": "Flex ECU Based On The Gasoline ECU",
            "image": "/New BTP/Automotive Engineering Laboratory/Flex ECU Based On The Gasoline ECU.jpg",
            "description": [
              "The Flex ECU based on a gasoline ECU is a versatile engine control unit designed to interface seamlessly between automotive sensors, actuators, and application software. This ECU is crucial in engine testing and development as it allows for real-time monitoring and control of engine functions, such as fuel injection, ignition timing, and air-fuel ratio.",
            
              "The Flex ECU collects data from various sensors (e.g., temperature, pressure, oxygen sensors) and communicates it to application software for analysis and optimization. In testing environments, the Flex ECU enables engineers to simulate different driving conditions and modify control parameters, helping them evaluate how the engine responds to changes.",
            
              "By adjusting actuator settings like throttle position and valve timing, engineers can fine-tune performance and efficiency. The Flex ECU’s adaptability also makes it useful for calibrating systems to meet emissions standards, troubleshoot issues, and optimize vehicle drivability. It bridges hardware and software, facilitating comprehensive engine system testing and development."
            ]
            },
          {
            "name": "Raspberry Pi-3 Model B/Arduino",
            "image": "/New BTP/Automotive Engineering Laboratory/Raspberry Pi-3 Model B Arduino.jpg",
            "description": [
              "The Raspberry Pi 3 Model B and Arduino are used for interfacing between the model-based design of systems like Anti-lock Braking Systems (ABS), Electric Power Steering (EPS), power windows, and their actual hardware components. These platforms serve as a bridge, allowing the simulation and control models developed on software to be tested and executed in real-time on physical systems.",
            
              "In model-based design, engineers create control algorithms and test scenarios in simulation environments. The Raspberry Pi and Arduino can then execute these algorithms and control the actual hardware components through sensors and actuators. For example, in ABS, the Raspberry Pi or Arduino can process data from wheel sensors and send commands to modulate brake pressure.",
            
              "These platforms allow for rapid prototyping, real-time testing, and debugging of embedded systems, ensuring that the algorithms perform correctly before final integration into the vehicle’s ECUs. This process accelerates development and ensures system reliability."
            ]
            },
          {
            "name": "ABS Simulator",
            "image": "/New BTP/Automotive Engineering Laboratory/ABS Simulator.jpg",
            "description": [
              "An ABS Simulator is used to study and test the functionality of Anti-lock Braking Systems (ABS) in a controlled environment without requiring a physical vehicle. It simulates the braking dynamics, allowing engineers to analyze the system's behavior during different driving conditions, such as emergency braking or slippery road surfaces.",
            
              "The ABS Simulator mimics the vehicle's braking system by generating signals that simulate wheel speed, brake pressure, and other relevant parameters. Engineers can use the simulator to evaluate the ABS response, such as modulating brake pressure to prevent skidding and maintain vehicle stability. It is also used for fine-tuning ABS algorithms and performing diagnostic tests on the system. By providing a safe and repeatable environment, the ABS simulator accelerates the development and testing process of ABS systems before integration into actual vehicles."
            ]
            },
          {
            "name": "ECU Simulator",
            "image": "/New BTP/Automotive Engineering Laboratory/ECU Simulator.jpg",
            "description": [
              "An ECU Simulator is used to understand and analyze the function of an Electronic Control Unit (ECU) in a virtual environment. It replicates the behavior of real ECUs that control various vehicle functions, such as engine management, braking systems, and infotainment, by emulating their inputs, outputs, and communication protocols.",
            
              "The ECU simulator allows engineers to test and validate control algorithms, sensors, and actuators in a controlled, virtual setting without the need for actual hardware. It interfaces with software-based models and provides simulated signals that mimic real-world data from sensors or user inputs. The simulator can be used to evaluate the ECU's response to different driving conditions, sensor failures, or component interactions, facilitating debugging and optimization before physical integration. By offering a risk-free environment, the ECU simulator enables faster prototyping, system tuning, and troubleshooting, ensuring that the ECU's performance meets safety, reliability, and efficiency standards in the final product."
            ]
            },
          {
            "name": "Electronic Throttle Control With Accelerator Pedal Rig.jpg",
            "image": "/New BTP/Automotive Engineering Laboratory/Electronic Throttle Control With Accelerator Pedal Rig.jpg",
            "description": [
              "The Electronic Throttle Control (ETC) with Accelerator Pedal Rig is used to study and understand the function of electronic throttle systems in a virtual environment. It simulates the interaction between the accelerator pedal and the vehicle’s throttle body, which is responsible for regulating engine power based on driver input.",
            
              "The rig consists of an accelerator pedal sensor, an actuator that controls throttle position, and software to emulate engine control module (ECM) behavior. When the driver presses the accelerator pedal, the sensor transmits the position data to the ECM, which adjusts the throttle opening to control engine speed. In a virtual environment, this setup allows engineers to test the responsiveness and behavior of the ETC system under various conditions without needing a physical vehicle.",
            
              "The simulator aids in optimizing control algorithms, troubleshooting issues, and improving performance. It also enables safe and efficient testing of throttle response, driveability, and system reliability before integration into actual vehicles."
            ]
            },
          {
            "name": "Electric Van",
            "image": "/New BTP/Automotive Engineering Laboratory/Electric-Van.jpg",
            "description": [
              "An Electric Van that is in-house fabricated is used to understand and evaluate the performance of electric vehicles (EVs). It serves as a platform for testing and experimenting with various EV components, including the battery pack, electric motor, charging system, and power electronics, in a real-world setting.",
            
              "Engineers use the electric van to simulate different driving conditions, such as acceleration, braking, and energy consumption, to study the efficiency and range of the vehicle. The in-house fabrication allows for customization, enabling the van to be equipped with specific sensors and control systems that measure parameters like battery health, energy regeneration, and motor performance.",
            
              "This platform is also used for optimizing vehicle control strategies, including regenerative braking and energy management. By testing various components and configurations in-house, engineers can troubleshoot, validate, and fine-tune the electric vehicle’s performance before scaling production or integrating it into commercial applications."
            ]
            },
          {
            "name": "2 DOF Vehicle Driving Simulator",
            "image": "/New BTP/Automotive Engineering Laboratory/2 DOF Vehicle Driving Simulator.jpg",
            "description": [
              "A 2 DOF (Degrees of Freedom) Vehicle Driving Simulator is used to study and analyze the driving behavior of a vehicle in a virtual environment. The simulator provides a realistic, interactive platform where engineers and researchers can assess how a vehicle behaves under various driving conditions without the need for a physical vehicle.",
            
              "The '2 DOF' refers to the simulator's ability to replicate two types of motion, typically pitch and roll, which are crucial for simulating vehicle dynamics such as acceleration, braking, and cornering. The system includes a driving seat, steering wheel, pedals, and motion actuators that mimic the vehicle’s response to user input. It interfaces with a virtual environment that simulates road conditions, vehicle performance, and traffic scenarios.",
            
              "This setup allows for the evaluation of driver control, vehicle handling, and safety features under different conditions, such as slippery roads or emergency maneuvers. It is invaluable for developing and testing advanced driver assistance systems (ADAS) and vehicle control algorithms."
            ]
            },
          {
            "name": "Diffused Light Polariscope",
            "image": "/New BTP/Automotive Engineering Laboratory/Diffused Light Polariscope.jpg",
            "description": [
              "A Diffused Light Polariscope (DLP) is a specialized optical instrument used to detect and analyze stress patterns in transparent or semi-transparent materials. It operates on the principle of polarized light, which interacts with the internal stresses in a material, revealing their distribution.",
            
              "The device consists of a light source, polarizing filters, and sometimes a retardation plate. The light source emits diffused light, which passes through a polarizing filter to produce polarized light. The test sample is placed between crossed polarizers, and any internal stresses cause the polarized light to split into components, producing interference patterns visible as fringes.",
            
              "DLPs are widely used in material science, quality control, and manufacturing to evaluate residual stresses in glass, plastics, and other transparent materials. By identifying stress concentrations, they help prevent material failure and ensure product reliability, particularly in industries like optics, aerospace, and electronics."
            ]
            },
          {
            "name": "Model of Steering System",
            "image": "/New BTP/Automotive Engineering Laboratory/Model of Steering system.jpg",
            "description": [
              "A model of a steering system is used to simulate and demonstrate the principles of vehicle steering mechanics. It represents the key components of a steering mechanism, such as the steering wheel, steering column, rack and pinion, linkages, and wheels, to study how input from the driver translates into wheel movement.",
            
              "The model helps in understanding different types of steering systems, including manual, power-assisted, and electronic steering. It allows users to observe how forces are transmitted from the steering wheel to the wheels, and how the geometry of the steering mechanism affects the vehicle's handling and stability.",
            
              "Steering system models are commonly used in automotive engineering education, design testing, and research. They are employed to study steering dynamics, improve vehicle handling, and test various steering configurations. By using the model, engineers can analyze performance, identify potential issues, and develop more efficient and responsive steering systems."
            ]
            },
          {
            "name": "Model of Passenger Car Electrical Wiring System",
            "image": "/New BTP/Automotive Engineering Laboratory/Model of Passenger Car- Electrical Wiring System.jpg",
            "description": [
              "A model of a passenger car electrical wiring system is used to demonstrate and study the layout and functioning of the electrical circuits in a vehicle. It represents the key components such as the battery, alternator, fuses, wiring harnesses, lights, switches, and other electrical devices like the ignition system, power windows, and infotainment systems.",
              
              "The model helps in understanding the distribution of electrical power throughout the car and how different electrical components are interconnected. It provides a hands-on learning tool for understanding circuit protection, grounding, and the flow of current through various systems.",
              
              "This model is primarily used in automotive education, training, and troubleshooting. It allows engineers and technicians to practice diagnosing faults, repairing wiring issues, and ensuring that the electrical system operates safely and efficiently. By using the model, one can visualize and test electrical connections before implementing them in a real vehicle."
            ]
            },
          {
            "name": "Cut Section Model of Disc Brake System",
            "image": "/New BTP/Automotive Engineering Laboratory/Cut Section Model of Disc Brake System.jpg",
            "description": [
              "A cut section model of a disc brake system is used to visually demonstrate the internal components and working principles of a disc brake. The model typically features a cutaway view of the brake rotor, brake pads, caliper, and the hydraulic or mechanical linkages that apply force to the pads. By exposing the internal structure, it allows for a clearer understanding of how the frictional force is generated to slow down or stop a vehicle.",
              
              "The cut section model helps to illustrate key elements such as the rotation of the disc, the interaction between the brake pads and the rotor, and the role of hydraulic pressure in actuating the calipers. It also showcases the design of the cooling vents within the rotor to dissipate heat.",
              
              "This model is widely used in automotive engineering education, training, and research to teach brake system functionality, diagnose performance issues, and improve disc brake designs for enhanced safety and efficiency."
            ]
            },
          {
            "name": "Cut Section Model of Drum Brake Unit",
            "image": "/New BTP/Automotive Engineering Laboratory/Cut Section Model of Drum Brake Unit.jpg",
            "description": [
              "A cut section model of a drum brake unit is used to visually demonstrate the internal components and working principles of a drum brake system. The model features a cutaway view of the brake drum, brake shoes, wheel cylinder, and the linkages that operate the system. It allows for a clear understanding of how braking force is applied to slow down or stop a vehicle.",
              
              "In the drum brake system, hydraulic pressure from the master cylinder pushes the wheel cylinder, forcing the brake shoes outward to contact the inner surface of the rotating drum, generating friction. The cut section model illustrates how the shoes expand, how the drum rotates, and the interaction between the shoes and the drum surface.",
              
              "This model is commonly used in automotive education and training to explain drum brake operation, diagnose issues like brake shoe wear or uneven pressure distribution, and improve brake system design for better performance and safety."
            ]
            },
          {
            "name": "Cut Section Model of Power Windows with One Door",
            "image": "/New BTP/Automotive Engineering Laboratory/Cut Section Model of Power Windows with One door.jpg",
            "description": [
              "A cut section model of power windows with one door is used to demonstrate the internal mechanism and operation of a power window system in a vehicle. The model typically features a cutaway view of the door panel, motor, regulator, and associated components such as the window lift, switches, and wiring.",
              
              "This model helps to visually explain how the power window operates, where the electric motor drives a gear mechanism (regulator) to move the window up or down within the door frame. It shows the interaction between the motor, regulator, and window glass, highlighting the role of electrical circuits in controlling the movement. The cut section also reveals safety features like anti-pinch mechanisms, which prevent the window from closing if an obstruction is detected.",
              
              "Primarily used in automotive education and training, this model allows students and technicians to understand the working principle, diagnose faults, and gain insights into the design and maintenance of power window systems."
            ]
            },
          {
            "name": "Demonstration Board of Electronic Ignition System of 4 Wheeler Automobile",
            "image": "/New BTP/Automotive Engineering Laboratory/Demonstration Board of Electronic Ignition System of 4 Wheeler Automobile.jpg",
            "description": [
              "A demonstration board of the electronic ignition system in a 4-wheeler automobile is used to showcase the functioning and components of a modern electronic ignition system. This board typically includes a display of components such as the ignition coil, distributor, sensor, control module, spark plugs, and wiring. It is designed to simulate the ignition process in a vehicle, where the electronic control module (ECM) manages the timing and firing of the spark plugs to ignite the air-fuel mixture in the engine.",
              
              "The model helps explain how the system replaces traditional mechanical points with electronic sensors and circuits to control ignition timing more precisely. It also illustrates how the system adjusts the spark based on engine parameters like speed and load for better fuel efficiency and performance.",
              
              "Used in automotive education and training, the demonstration board enables students and technicians to understand the system's operation, diagnose issues, and learn how electronic ignition systems contribute to vehicle performance and reliability."
            ]
            },
          {
            "name": "Cut Section Model of Complete Both Side MacPherson Suspension Strut with Drive Shaft",
            "image": "/New BTP/Automotive Engineering Laboratory/Cut Section Model of Complete Both Side MacPherson Suspension Strut with Drive Shaft.jpg",
            "description": [
              "A cut section model of a complete MacPherson suspension strut with a drive shaft is used to demonstrate the working principles and components of this common automotive suspension system. The model features a cutaway view of the strut assembly, which includes the coil spring, shock absorber, strut mount, steering knuckle, and the drive shaft. This allows for a detailed view of how the suspension system absorbs shocks and helps maintain vehicle stability by controlling wheel movement.",
              
              "The MacPherson strut combines the shock absorber and spring into a single unit, allowing for efficient space utilization and reduced weight. The drive shaft is connected to the wheel hub, transmitting power from the engine to the wheels. This model demonstrates how these components work together to support the vehicle’s weight, absorb road shocks, and maintain proper wheel alignment.",
              
              "Used in automotive education and training, the cut section model helps in understanding suspension dynamics, diagnosing issues, and improving suspension system design."
            ]
            },
          {
            "name": "Demonstration Board of Fuel Supply System of Diesel Engine (Working)",
            "image": "/New BTP/Automotive Engineering Laboratory/Demonstration Board of Fuel Supply System of Diesel Engine Working.jpg",
            "description": [
              "A demonstration board of the fuel supply system of a diesel engine is used to illustrate the components and operation of the system that delivers fuel to the engine for combustion. The model typically includes components such as the fuel tank, fuel pump, fuel filter, injectors, and fuel lines, along with the necessary connections to show the flow of fuel.",
              
              "This system works by transferring fuel from the tank through the pump, which pressurizes the fuel and delivers it to the injectors. The injectors atomize the fuel into the combustion chamber, where it mixes with air and ignites under pressure, powering the engine. The demonstration board helps in understanding how each part of the fuel system works together to ensure efficient fuel delivery and combustion.",
              
              "Used in automotive engineering education and training, this board enables students and technicians to visualize the fuel flow, troubleshoot issues like blockages or pressure problems, and learn about the system's role in engine performance and fuel efficiency."
            ]
            },
          {
            "name": "Subsonic Wind Tunnel",
            "image": "/New BTP/Automotive Engineering Laboratory/Subsonic Wind Tunnel.jpg",
            "description": [
              "A subsonic wind tunnel is used to study the aerodynamic properties of objects at speeds below the speed of sound (Mach 1). It is designed to simulate airflow over models of aircraft, vehicles, or other structures in a controlled environment to analyze forces like lift, drag, and turbulence. The wind tunnel consists of a test section where the model is placed, and air is pumped through the tunnel at subsonic speeds, typically ranging from 0 to 0.8 Mach.",
              
              "The model is equipped with sensors to measure forces and pressure distribution, while visual tools like smoke or laser lights can be used to observe airflow patterns around the model. The results from the wind tunnel provide valuable data on aerodynamic performance, helping in the design of more efficient and stable vehicles, aircraft, and structures.",
              
              "Subsonic wind tunnels are widely used in aerospace engineering, automotive testing, and research to optimize designs for better performance, fuel efficiency, and safety."
            ]
            },
          {
            "name": "Multi-Tube Manometer",
            "image": "/New BTP/Automotive Engineering Laboratory/Multi Tube Manometer.jpg",
            "description": [
              "A multi-tube manometer is an instrument used to measure pressure differences in fluids, typically in fluid mechanics and engineering applications. It consists of multiple vertical tubes filled with a liquid, such as mercury or water, connected at both ends to two points in a fluid system where pressure is to be measured. The pressure difference between the two points causes the liquid level in the tubes to rise or fall, providing a visual representation of the pressure difference.",
              
              "Each tube in the manometer corresponds to a different measurement, allowing for the comparison of pressure differences at multiple points in a system simultaneously. The manometer is often used in laboratory settings, HVAC systems, and fluid flow experiments to measure pressure drops across filters, pipes, or air ducts.",
              
              "It is used for accurate and precise pressure measurements, helping in the analysis of fluid behavior, system efficiency, and troubleshooting pressure-related issues in various engineering fields."
            ]
            },
          {
            "name": "Cut Section Model of Complete Both Side Double Wishbone Suspension Strut with Drive Shaft",
            "image": "/New BTP/Automotive Engineering Laboratory/Cut Section Model of Complete Both Side Double Wishbone Suspension Strut with Drive Shaft.jpg",
            "description": [
              "A cut section model of a complete double wishbone suspension strut with a drive shaft is used to demonstrate the components and working principles of this suspension system, which is commonly used in modern vehicles for improved handling and stability. The model features a cutaway view of the double wishbone suspension, including the upper and lower control arms (wishbones), struts, coil springs, shock absorbers, and the drive shaft.",
              
              "The double wishbone setup allows for better control over wheel alignment and movement, providing improved ride comfort and cornering performance. The drive shaft transmits power from the engine to the wheels, integrating with the suspension system to support vehicle dynamics.",
              
              "Used in automotive education and training, this model helps students and engineers understand the suspension's role in vehicle handling, its design benefits, and how each component functions together. It is also useful for diagnosing suspension-related issues and improving suspension system designs for enhanced vehicle performance and safety."
            ]
            }
        ]
      }, 
      {
        "name": "Measurement Instrumentation and Control Laboratory",
        "equipments": [
          {
            "name": "Surface Roughness Tester",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Surface Roughness Tester.jpg",
            "description": [
              "A surface roughness tester is a precision instrument used to measure the roughness or texture of a material's surface. It quantifies surface irregularities or deviations from a perfectly smooth surface, which are critical for understanding the material's functionality in various applications like friction, wear, and appearance.",
              
              "The tester typically consists of a probe that moves along the surface being tested. The probe detects minute variations in the surface height, generating a profile that is analyzed to determine roughness parameters such as Ra (average roughness) and Rz (maximum height of the profile). The results help engineers assess whether the surface finish meets specified standards for manufacturing or design purposes.",
              
              "Surface roughness testers are used in industries like automotive, aerospace, and manufacturing to ensure the proper surface finish of components, ensuring they perform optimally. They are valuable in quality control and R&D for testing different materials and machining processes for precise surface finishes."
            ]
            },
          {
            "name": "Temperature Measuring Setup",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Temperature Measuring Setup.jpg",
            "description": [
              "A temperature measuring setup is an instrument used to accurately measure the temperature of a system or environment. It typically consists of temperature sensors (such as thermocouples, resistance temperature detectors (RTDs), or thermistors), a display or data acquisition system, and a power supply. The sensors detect temperature changes and convert them into electrical signals, which are then processed and displayed as a temperature reading.",
              
              "The setup can be used in a variety of applications, including industrial processes, HVAC systems, scientific research, and equipment testing. It is crucial for monitoring and controlling temperature-sensitive processes, such as in manufacturing, chemical reactions, or thermal testing of materials.",
              
              "Temperature measuring setups are used to ensure that systems operate within the required temperature range, prevent overheating or freezing, and ensure the safety and efficiency of processes. In a lab setting, they are employed to calibrate and test temperature-sensitive equipment, enabling precise measurements in experiments and product development."
            ]
            },
          {
            "name": "Force Measuring Setup",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Force Measuring Setup.jpg",
            "description": [
              "A force measuring setup is an instrument used to measure the magnitude of force applied to an object or system. It typically consists of a load cell or force transducer, a display unit or data acquisition system, and necessary mounting fixtures. The load cell, which is the core component, converts the applied force into an electrical signal that can be measured and displayed.",
              
              "The setup is used in various applications such as material testing, structural testing, manufacturing, and research to quantify forces like compression, tension, or shear. It is essential for testing the strength, durability, and performance of materials, as well as for calibrating other equipment.",
              
              "In industrial settings, force measuring setups help ensure product quality by verifying force limits during assembly or testing. In labs, they are used to study material behavior under different loads, evaluate the performance of mechanical systems, and perform experiments requiring precise force measurement."
            ]
            },
          {
            "name": "Torque Measuring Setup",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Torque Measuring Setup.jpg",
            "description": [
              "A torque measuring setup is an instrument used to measure the rotational force or torque applied to a shaft or mechanical component. The setup typically consists of a torque sensor or transducer, which is capable of detecting the twisting force, and a display or data acquisition system that provides the measured torque value. The sensor is designed to be compact and rugged, making it suitable for heavy-duty applications where high durability and reliability are crucial.",
              
              "The setup is compensated for axial and bending moments, ensuring high accuracy even in challenging conditions where external forces may interfere with the measurement. This compensation helps to eliminate errors caused by misalignment or mechanical stress.",
              
              "Torque measuring setups are used in industries like automotive, aerospace, and manufacturing to test the performance of engines, drivetrains, and mechanical systems. They are essential for assessing power transmission, optimizing designs, and ensuring that equipment operates within specified torque limits for safety and efficiency."
            ]
            },
          {
            "name": "Linear Air Track Apparatus",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Linear Air Track Apparatus.jpg",
            "description": [
              "A linear air track apparatus is used to study the principles of motion, conservation of momentum, and collisions in physics experiments. It consists of a long, horizontal track with a low-friction surface, typically supported by a cushion of air, allowing gliders to move along the track with minimal resistance.",
              
              "The apparatus is used to demonstrate the motion of objects under different conditions, such as uniform motion or accelerated motion. It allows for experiments on the conservation of momentum by studying collisions between gliders, either through manual methods (where gliders are manually pushed together) or magnetic methods (where magnets are used to control the motion or collision of the gliders).",
              
              "By analyzing the motion and velocities of the gliders before and after collisions, students can directly observe the conservation of momentum in elastic or inelastic collisions. The setup is commonly used in educational settings to provide hands-on experience in fundamental concepts of mechanics and physics."
            ]
            },
          {
            "name": "Dial Gauge Calibration Setup",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Dial Gauge Calibration Setup.jpg",
            "description": [
              "A dial gauge calibration setup is used to accurately calibrate dial gauges with a measurement range of 0-25mm and a least count (L.C.) of 0.001mm. The setup consists of a precision measuring surface, such as a micrometer or standard reference block, and a fixture to hold the dial gauge in place. The reference surface provides known, precise measurements to compare against the readings of the dial gauge.",
              
              "The calibration process involves placing the dial gauge in contact with the reference surface and adjusting the gauge's needle or reading to match the known values at different measurement points. This ensures that the dial gauge provides accurate and consistent readings when used in various applications, such as measuring linear displacement, thickness, or alignment in machining, quality control, and mechanical testing.",
              
              "The dial gauge calibration setup is crucial for ensuring the precision and reliability of measuring instruments, which is essential in industries that require high levels of accuracy, such as manufacturing and engineering."
            ]
            },
          {
            "name": "Height Gauge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Height gauge.jfif",
            "description": [
              "A height gauge is a precision instrument used to measure the height or vertical dimensions of objects with high accuracy. It typically consists of a vertical column, a measuring probe or scriber, and a base, which allows the gauge to be placed on a flat surface like a surface plate. The gauge is often equipped with a micrometer screw or digital display for precise readings.",
              
              "Height gauges are commonly used in mechanical engineering, quality control, and manufacturing to measure the height of components, check for surface flatness, or mark precise reference points on workpieces. The base of the height gauge ensures that measurements are taken from a stable, consistent reference surface.",
              
              "The instrument is also used in combination with a dial indicator or digital scale to measure deviations from the intended height, helping to verify the dimensions of components to ensure they meet design specifications. Height gauges are essential for ensuring the accuracy of machined parts and assemblies."
            ]
            },
          {
            "name": "Profile Projector",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Profile-Projector.jpg",
            "description": [
              "A profile projector is an optical measuring instrument used to project a magnified image of an object's profile onto a screen for precise measurement and inspection. It consists of a light source, lenses, and a screen where the shadow or silhouette of the part is projected. The object is placed on a stage, and the projector's optics create a scaled image, allowing operators to inspect the part’s shape and dimensions.",
              
              "Profile projectors are commonly used in small parts machine shops or production lines by quality control teams to inspect components for accuracy, especially in precision manufacturing. The projected image allows for easy measurement of complex profiles, contours, and geometric features such as holes, angles, and radii, with the help of overlay grids or digital measurement tools.",
              
              "This equipment ensures that parts meet specified tolerances, contributing to quality control and enhancing the efficiency of manufacturing processes by quickly identifying defects or deviations from design specifications."
            ]
            },
          {
            "name": "Floating Carriage Micrometer",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Floating Carriage Micrometer.jpg",
            "description": [
              "A floating carriage micrometer is a precision instrument used for the accurate measurement of thread plug gauges, which are essential in checking the dimensions of internal threads in mechanical parts. This micrometer consists of a frame with a movable anvil and a spindle, where the plug gauge is placed for measurement. The floating carriage allows the micrometer to adapt to the contour of the gauge, ensuring that the measurement is taken along the correct axis, even for irregular or tapered surfaces.",
              
              "It is primarily used to measure the minor diameter, major diameter, and effective diameter of threaded parts. The minor diameter refers to the smallest diameter of the internal thread, the major diameter is the largest, and the effective diameter is the functional diameter of the thread that affects its engagement with a mating part.",
              
              "Used in precision engineering and quality control, the floating carriage micrometer ensures that thread plug gauges conform to tight tolerances, critical for ensuring proper fit and function of threaded components."
            ]
            },
          {
            "name": "Sine Bar",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Sine-bar.jpg",
            "description": [
              "A sine bar is a precision measuring tool used to measure or set angles with high accuracy. The sine bar consists of a hardened, calibrated steel bar with two accurately ground cylinders (rollers) at its ends. It is typically used in conjunction with slip gauge blocks to set or measure the angles of components or workpieces.",
              
              "To use the sine bar for angular measurement, the bar is placed on a flat surface, and slip gauge blocks are stacked under one of the rollers to achieve the desired height. The angle is determined by the sine of the angle being equal to the ratio of the height of the slip gauges to the length of the sine bar. For example, using a 200mm sine bar, the height of the slip gauge stack determines the angle, calculated using the sine formula.",
              
              "Sine bars are commonly used in machining and quality control to measure or set precise angles for parts and tools, ensuring they meet required specifications in industries such as aerospace and automotive."
            ]
            },
          {
            "name": "3-D Coordinate Measuring Machine",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/3-D Coordinate Measuring Machine.jpg",
            "description": [
              "A 3-D coordinate measuring machine (CMM) is a precision instrument used to measure the geometry of physical objects by sensing discrete points on the surface of the object with a probe. The CMM typically consists of a probe (mechanical, optical, or laser), a movable arm or bridge, and a computer system that processes the data.",
              
              "To use the CMM, the object is placed on a fixed platform, and the probe is directed to various points on the object's surface. The machine records the 3D coordinates of each point, allowing for the precise measurement of complex shapes, dimensions, and features such as holes, slots, or contours. The collected data is then analyzed to check if the part meets the required specifications and tolerances.",
              
              "CMMs are widely used in quality control, manufacturing, and research to ensure the accuracy and precision of machined parts, molds, and assemblies, improving product quality and reducing errors in production."
            ]
            },
          {
            "name": "Gear Tooth Vernier",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Gear tooth Vernier.jfif",
            "description": [
              "A gear tooth vernier is a specialized measuring instrument used to precisely measure the thickness of gear teeth, as well as the dimensions of hobs, form tools, and thread tools. It consists of a set of calibrated jaws with a micrometer screw or a digital scale that allows for accurate measurement of the tooth thickness, pitch, and profile.",
              
              "To use the gear tooth vernier, the tool is placed between the teeth of a gear, and the jaws are adjusted to measure the thickness at a specific point along the tooth's profile. The instrument typically allows measurements at various positions, such as at the pitch circle or at the base, to ensure consistent gear geometry.",
              
              "Gear tooth vernieres are essential in the manufacturing and inspection of gears to ensure that they meet precise design specifications and function correctly in mechanical systems. They are widely used in gear manufacturing, automotive industries, and quality control processes for ensuring optimal gear performance and fit."
            ]
            },
          {
            "name": "Slip Gauge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Slip gauge.jfif",
            "description": [
              "A slip gauge, also known as a gauge block, is a precision measuring tool used to establish or verify exact lengths with high accuracy. Slip gauges consist of a set of steel or carbide blocks, each of which is calibrated to a specific length. These blocks can be stacked together to achieve a desired measurement.",
              
              "To use a slip gauge, the blocks are stacked in combinations on a surface plate or other flat reference surface. By aligning the blocks precisely, the user can obtain a required length with a very high degree of accuracy, often up to micrometer levels. The individual blocks are made with extremely tight tolerances, and the total length is calculated by adding the individual block lengths.",
              
              "Slip gauges are widely used in calibration, quality control, and precision machining to ensure that measuring instruments, such as micrometers and height gauges, are accurate. They are also used for setting or verifying the dimensions of parts, ensuring high precision in manufacturing."
            ]
            },
          {
            "name": "Straight Edge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Straight edge.jfif",
            "description": [
              "A straight edge is a simple measuring tool used to draw straight lines or check the straightness of a surface or object. Typically made from metal, wood, or plastic, it consists of a long, flat, and rigid body with a precisely straight edge. If the straight edge has equally spaced markings along its length, it is referred to as a ruler, which can also be used for measuring distances.",
              "To use a straight edge, the user places it along a surface or object that needs to be checked for straightness. The edge of the tool acts as a reference to identify any deviations or warping in the surface. In the case of drawing lines, the straight edge ensures that the lines are perfectly straight.",
              "Straight edges are commonly used in technical drawing, woodworking, and manufacturing to ensure the precision and accuracy of measurements and designs, particularly when creating or verifying straight lines in construction or machining."
            ]
            },
          {
            "name": "Ring Gauge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Ring Gauge.jfif",
            "description": [
              "A ring gauge is a precision tool used to measure the external dimensions of cylindrical parts, specifically their diameter. It consists of a ring with a hole that is precisely made to a specific size. The ring gauge is used to check whether the outer diameter of a workpiece fits within the desired tolerance range.",
              "To use a ring gauge, the workpiece is inserted into the ring, and the fit is checked. If the workpiece fits snugly inside the gauge without excessive play, it is within the specified tolerance range. If it is too loose or too tight, the workpiece is considered out of specification.",
              "Ring gauges are typically used in quality control and manufacturing processes to inspect shafts, pins, and other cylindrical components. They ensure that parts meet the required dimensional accuracy and are crucial for maintaining consistent quality in mechanical assemblies, such as engines and machinery."
            ]
            },
          {
            "name": "Filler Gauge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Filler Gauge.jfif",
            "description": [
              "A filler gauge is used to measure the clearance or gap between two parts. It consists of a series of thin, flat metal blades, each with a different thickness, typically marked in thousandths of an inch or millimeters. The blades are assembled together in a holder for easy handling and storage.",
              "To use a filler gauge, the appropriate blade is selected based on the required measurement and inserted into the gap or clearance between two parts. The blade should fit snugly in the space, but not too tightly, indicating that the clearance matches the thickness of the blade. If the blade can be inserted without resistance, a larger blade is selected, and the process is repeated until the correct clearance is determined.",
              "Filler gauges are widely used in engineering, automotive, and manufacturing applications for checking clearances in engine parts, bearings, valve settings, and other machinery to ensure proper fit and function."
            ]
            },
          {
            "name": "Snap Gauge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Snap gauge.jfif",
            "description": [
              "A snap gauge is a precision measuring tool used to measure the external dimensions, such as the diameter or thickness, of cylindrical or flat workpieces. It typically consists of two adjustable arms or jaws, a set of anvils, and a measuring scale. Snap gauges are designed for quick and efficient measurements during manufacturing or quality control processes.",
              "To use a snap gauge, the workpiece is placed between the two arms or jaws, which are then snapped shut around the part. The dimensions of the part are read directly from the scale or a digital display. Snap gauges are often used in production lines for rapid and repetitive measurements, ensuring parts meet the required tolerances.",
              "Snap gauges are commonly used in industries such as automotive, aerospace, and machining for checking shafts, pins, and other components. Their quick measurement capabilities make them ideal for high-volume production environments, providing fast, accurate checks of part dimensions."
            ]
            },
          {
            "name": "V-Block",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/V- Block.jfif",
            "description": [
              "A V-block is a precision tool used to securely hold cylindrical workpieces, such as shafts or rods, during machining operations like milling, drilling, or grinding. The V-shaped groove in the block is designed to accommodate the cylindrical shape of the workpiece, ensuring it is held firmly in place for accurate measurements or machining.",
              "To use a V-block, the cylindrical workpiece is placed in the V-shaped groove, where it is aligned and held securely. The V-block is then clamped to the machine's work surface or tool station, allowing precise operations to be performed on the workpiece. Some V-blocks may also include holes for additional clamping or for mounting the block to a work surface.",
              "V-blocks are commonly used in machining, quality control, and assembly work to inspect cylindrical parts, measure diameters, or perform precise cutting and drilling tasks. Their stability and versatility make them indispensable in industries such as automotive, aerospace, and metalworking."
            ]
            },
          {
            "name": "Pitch Gauge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Pitch Gauge.jfif",
            "description": [
              "A pitch gauge is a precision measuring tool used to measure the pitch of threads on screws, bolts, or other threaded components. The pitch refers to the distance between adjacent threads, which is a critical measurement for ensuring the correct fit and function of threaded parts. The pitch gauge consists of a set of blades or leaves, each marked with a specific thread pitch measurement.",
              "To use a pitch gauge, the user selects the appropriate blade with the matching thread pitch and places it in contact with the threads of the part being measured. The blade should fit perfectly into the threads without any gaps or force. By comparing the gauge blade with the threads, the user can determine the pitch of the threaded component.",
              "Pitch gauges are commonly used in mechanical engineering, manufacturing, and quality control to inspect and verify thread dimensions. They ensure that threaded parts meet the required specifications for proper assembly and function in mechanical systems."
            ]
            },
          {
            "name": "Go & No-Go Gauge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Go & No Go gauge.jfif",
            "description": [
              "A Go and No-Go gauge is a precision tool used to check whether a part’s dimensions are within specified tolerance limits. It consists of two parts: the \"Go\" gauge and the \"No-Go\" gauge. The \"Go\" gauge is used to check if the part is within the minimum acceptable size, while the \"No-Go\" gauge checks if the part exceeds the maximum allowable size.",
              "To use the gauge, the part is tested first with the \"Go\" gauge. If the part fits or passes through the \"Go\" gauge, it is considered to meet the minimum requirement. Then, the part is checked with the \"No-Go\" gauge. If the part does not fit or pass through the \"No-Go\" gauge, it is within the maximum tolerance. If it fits, the part is out of specification.",
              "Go and No-Go gauges are commonly used in manufacturing, automotive, and engineering industries to ensure components meet precise dimensional requirements, ensuring quality and proper fit in assembly."
            ]
            },
          {
            "name": "Surface Plate",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Surface Plate.jfif",
            "description": [
              "A surface plate is a solid, flat reference plane used for precision inspection, marking out, and tooling setup. Made from materials such as granite, cast iron, or steel, the surface plate provides a stable and smooth base for measuring and checking the flatness, dimensions, and geometry of components in manufacturing or quality control.",
              "To use a surface plate, the component to be inspected is placed on the plate, and measurements or alignments are made using other precision tools, such as micrometers, calipers, or height gauges. The flatness and stability of the surface plate ensure accurate measurements, as any irregularities on the surface can affect the results.",
              "Surface plates are widely used in mechanical workshops, quality control labs, and assembly lines for checking the precision of machined parts and for layout work, ensuring that parts meet design specifications. They are essential for maintaining high standards of quality in industries like aerospace, automotive, and manufacturing."
            ]
            },
          {
            "name": "Micro Weight Balance",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Micro-Weight-Balance.jpg",
            "description": [
              "A micro weight balance, also known as a microbalance, is a highly sensitive instrument used to measure the mass of objects with extremely low weight, often in the range of milligrams or even micrograms (millionths of a gram). These balances are designed for precise measurements, typically used in laboratories or research settings where accuracy is critical.",
              "To use a microbalance, the object is placed on the weighing pan, and the balance measures the tiny force exerted by the object in response to electromagnetic or mechanical forces. The measured weight is then displayed digitally or analogically, with extremely high resolution and minimal error.",
              "Micro weight balances are commonly used in fields such as chemistry, pharmaceuticals, and material science, where measuring small amounts of substances (such as powders, chemicals, or small components) is essential. They ensure accurate formulations, quality control, and precise scientific analysis, making them vital in research and industrial applications where small mass measurements are required."
            ]
            },
          {
            "name": "Micrometer",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Micrometre.jfif",
            "description": [
              "A micrometer is a precision measuring tool used to measure the thickness, depth, or length of an object with high accuracy, typically in the range of micrometers (millionths of a meter). It consists of a spindle and anvil that form a measuring gap, with a calibrated screw mechanism to measure the distance between the two surfaces.",
              "To use a micrometer, the object is placed between the anvil and spindle, and the thimble or rotating sleeve is turned to bring the spindle into contact with the object. The micrometer has a scale that allows for precise measurement of the gap between the anvil and spindle, which corresponds to the dimensions of the object being measured.",
              "Micrometers are widely used in mechanical engineering, machining, and manufacturing for measuring small components like shafts, rods, or machine parts to ensure they meet exact tolerances. Their precision and accuracy make them essential for high-quality production and inspection tasks."
            ]
            },
          {
            "name": "Vernier Caliper",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Vernier calliper.jfif",
            "description": [
              "A Vernier caliper is a precision measuring instrument used to measure the internal and external dimensions of objects, as well as their depths. It consists of a main scale and a sliding Vernier scale that provides precise measurements with high accuracy, typically down to 0.02 mm or 0.001 inches.",
              "To use a Vernier caliper, the object is placed between the main scale and the sliding Vernier scale. The sliding scale is adjusted until it touches the object, and the measurement is read by aligning the marks on the Vernier scale with those on the main scale. The measurement is a combination of the readings from both scales, giving a highly accurate result.",
              "Vernier calipers are commonly used in mechanical engineering, machining, and quality control to measure the dimensions of small to medium-sized components, such as shafts, rods, or parts with irregular shapes, ensuring precise fitting and manufacturing tolerances."
            ]
            },
          {
            "name": "Depth Gauge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Depth gauge.jfif",
            "description": [
              "A depth gauge is a precision instrument used to measure the depth of holes, recesses, or grooves in a workpiece. It consists of a probe or measuring rod that is mounted on a scale, allowing the user to measure the depth of a cavity or indentation accurately. Depth gauges typically have a micrometer or Vernier scale for fine adjustments and accurate readings.",
              "To use a depth gauge, the user places the base of the instrument on the surface of the workpiece, with the probe extending into the hole or recess. The depth is then measured by adjusting the scale or reading the measurement directly from the graduated scale or digital display.",
              "Depth gauges are commonly used in machining, quality control, and manufacturing to ensure that the depth of holes or cavities in parts meets design specifications. They are particularly useful for checking the depth of drilled holes, slots, or other features where precise depth control is crucial."
            ]
            },
          {
            "name": "Bevel Protector",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Bevel Protector.jfif",
            "description": [
              "A bevel protector is a tool used to measure and protect the angles or bevels on the edges of materials, typically in machining, construction, or metalworking. It is designed to ensure that the beveled edges of components meet precise specifications, providing accurate angle measurements or settings for cutting, grinding, or finishing operations.",
              "To use a bevel protector, the device is placed along the beveled edge of a workpiece. It may have an adjustable scale or fixed angle that aligns with the edge to verify the angle's accuracy. The protector is often used in combination with other measuring instruments to maintain the correct bevel angle, ensuring consistency and precision in manufacturing processes.",
              "Bevel protectors are widely used in industries like construction, automotive, and fabrication, where precise edge angles are essential. They help prevent errors during cutting or finishing processes and ensure that the final product meets design requirements."
            ]
            },
          {
            "name": "Dial Gauge",
            "image": "/New BTP/Measurement Instrumentation and Control Laboratory/Dial gauge.jfif",
            "description": [
              "A dial gauge is a precision instrument used to measure small linear displacements with high accuracy, typically in the range of micrometers or thousandths of an inch. It consists of a dial face with a needle that moves in response to a mechanical probe that comes into contact with the surface being measured. The dial gauge is often used in applications such as checking the flatness, alignment, and roundness of components.",
              "To use a dial gauge, the probe is placed on the surface or part being measured, and any movement or displacement causes the needle to rotate on the dial. The reading on the dial indicates the amount of deviation or movement, which is critical for quality control in precision engineering."
            ]
            }
        ]
      }
    ]
  }